{
    "C:/Users/shrey/Downloads/yellow_ranger_dummy_document.pdf": {
        "filename": "yellow_ranger_dummy_document.pdf",
        "text": "POWER RANGERS HEADQUARTERS\nINTERNAL DOCUMENT — LEVEL 2 ACCESS\nDocument Title: FIELD OPERATIONS BRIEF — YELLOW RANGER\nDocument ID: PRHQ-OPS-0427-YR\nDate: 07/12/2025\nPrepared By: Operations Division\nSUMMARY:\nThis document provides updated operational directives for the Yellow Ranger regarding\npatrol responsibilities, communication protocols, and current field awareness.\n1. PATROL PRIORITIES:\n- Maintain surveillance over Sector 4B (East Ridge District).\n- Report unusual Morphin Grid fluctuations immediately.\n- Avoid direct engagement unless threat level exceeds Delta-Class.\n2. EQUIPMENT STATUS:\n- Yellow Ranger's Morpher: Fully operational.\n- Sidearm: Energy output within acceptable range.\n- Auxiliary Gear: Updated nano-armor plates installed.\n3. ACTIVE THREAT INTELLIGENCE:\n- Minor Puttie activity detected near the outskirts.\n- No confirmed sightings of high-level enemy commanders.\n- Recommend heightened awareness during solo patrols.\n4. TEAM COORDINATION:\n- Maintain open communication with Red and Blue Rangers during peak patrol hours.\n- Participate in scheduled training simulation at 1800 hours.\n\f5. NOTES:\nThis is a routine operations document. No immediate high-risk alerts issued.\nEND OF DOCUMENT\n",
        "summary": "This internal document outlines updated operational directives for the Yellow Ranger, focusing on patrol responsibilities, communication, and current field intelligence. The Yellow Ranger is to maintain surveillance over Sector 4B, report Morphin Grid fluctuations, and avoid direct engagement unless the threat level exceeds Delta-Class. All equipment is fully operational, including newly installed nano-armor. While only minor Puttie activity is detected, heightened awareness is recommended for solo patrols. The Yellow Ranger must maintain open communication with Red and Blue Rangers during peak hours and attend a scheduled training simulation at 1800. This is a routine brief with no immediate high-risk alerts.\n\n*   **Patrol Focus:** Surveillance of Sector 4B, immediate reporting of Morphin Grid fluctuations.\n*   **Engagement Policy:** Avoid direct engagement unless threat level exceeds Delta-Class.\n*   **Equipment Status:** All gear (Morpher, Sidearm, new nano-armor) is fully operational.\n*   **Threat Assessment:** Minor Puttie activity; no high-level commanders. Heightened awareness recommended for solo patrols.\n*   **Team Coordination:** Maintain open communication with Red and Blue Rangers, attend 1800 training simulation.\n*   **Alert Status:** Routine operations document; no immediate high-risk alerts issued.",
        "date": "2025-12-04",
        "category": "Operations",
        "vector_id": "file1"
    }
}