{
    "DOC_001": {
        "filename": "yellow_ranger_dummy_document.pdf",
        "text": "POWER RANGERS HEADQUARTERS\nINTERNAL DOCUMENT — LEVEL 2 ACCESS\nDocument Title: FIELD OPERATIONS BRIEF — YELLOW RANGER\nDocument ID: PRHQ-OPS-0427-YR\nDate: 07/12/2025\nPrepared By: Operations Division\nSUMMARY:\nThis document provides updated operational directives for the Yellow Ranger regarding\npatrol responsibilities, communication protocols, and current field awareness.\n1. PATROL PRIORITIES:\n- Maintain surveillance over Sector 4B (East Ridge District).\n- Report unusual Morphin Grid fluctuations immediately.\n- Avoid direct engagement unless threat level exceeds Delta-Class.\n2. EQUIPMENT STATUS:\n- Yellow Ranger's Morpher: Fully operational.\n- Sidearm: Energy output within acceptable range.\n- Auxiliary Gear: Updated nano-armor plates installed.\n3. ACTIVE THREAT INTELLIGENCE:\n- Minor Puttie activity detected near the outskirts.\n- No confirmed sightings of high-level enemy commanders.\n- Recommend heightened awareness during solo patrols.\n4. TEAM COORDINATION:\n- Maintain open communication with Red and Blue Rangers during peak patrol hours.\n- Participate in scheduled training simulation at 1800 hours.\n\f5. NOTES:\nThis is a routine operations document. No immediate high-risk alerts issued.\nEND OF DOCUMENT\n",
        "summary": "This internal document provides updated operational directives for the Yellow Ranger. Key points include maintaining surveillance over Sector 4B, immediately reporting Morphin Grid fluctuations, and avoiding direct engagement unless threats exceed Delta-Class. All equipment is fully operational, including newly installed nano-armor. Minor Puttie activity is noted, with no high-level enemy commanders, but heightened awareness is recommended during solo patrols. The Yellow Ranger is to maintain open communication with the Red and Blue Rangers and participate in a training simulation at 1800 hours. This is a routine brief with no immediate high-risk alerts.\n\n---\n\n**Key Topics:**\n\n*   **Patrol Responsibilities:** Surveillance of Sector 4B, immediate reporting of Morphin Grid fluctuations, avoid direct engagement unless Delta-Class threat.\n*   **Equipment Status:** Morpher, sidearm, and new nano-armor plates are fully operational.\n*   **Threat Intelligence:** Minor Puttie activity detected, no high-level commanders, heightened awareness recommended for solo patrols.\n*   **Team Coordination:** Open communication with Red/Blue Rangers, attend 1800-hour training simulation.\n*   **Overall:** Routine operations document with no immediate high-risk alerts.",
        "date": "2025-12-04",
        "category": "Operations",
        "vector_id": "file1"
    }
}