{
    "DOC_001": {
        "filename": "ASANA.pdf",
        "text": "VRIKSHASANA (TREE POSE) \nIt replicates the graceful, steady stance of a tree. Unlike most yoga poses, the \ntreepose requires keeping our eyes open in order to maintain body balance. \n \nSTEPS: \n● Stand tall and straight with arms by the side of your body. \n● Bend your right knee and place the right foot high up on your left thigh. The \nsole of thefoot should be placed \nflat and firmly near the foot of the thigh. \n● Make sure that your left leg is straight. Find your balance. \n● Once you are well balanced, take a deep breath in, gracefully raise your arms \nover yourhead from the side, \nand bring your palms together in ' Namaste' mudra. \n● Look straight ahead in front of you, at a distant object. A steady gaze helps \nmaintain asteady balance. \n● With slow exhalation gently bring down your hands from the sides. \n● Release your right leg firmly on mat. \n● Repeat same with other leg. \nBENEFITS : \n● It stretches the legs, back and arms. \n● It brings balance to your body and mind. \n● It relieves sciatica pain \n● It improves focus and concentration. \nCONTRADICTIONS: \n● Avoid this posture if you are suffering from migraine, insomnia. \n● Avoid in High and low blood pressure. \n● Avoid raising your hands overhead in case of High B.P also in case of vertigo. \n\fGARUDASANA (EAGLE POSE) \n \nINSTRUCTIONS: \n Stand in Tadasana. \n Exhale, Squat a little, inhale, lift the right leg up and wrap it around the left. \n Place the right hand in front, take the left hand from below and wraparound the \nright hand, palms closer and touching \neach other. \n Keep your spine straight, gaze at a point. \n Hold the posture for a while with normal breath. \n Release the right leg, relax the hands and stand in Tadasana. \n Repeat on the other side. \nBENEFITS OF GARUDASANA: \n Improves concentration. \n Strengthens muscles and loosens up joints of shoulders, arms and legs. \nCONTRAINDICATION OF GARUDASANA: \n People with knee, ankle and shoulder injury must avoide. \n \nUTTHITA TRIKONASANA (Extended Triangle \nPose) \nIt is a foundation triangle pose that’s performed in different styles of yoga. \n\f \nSTEPS: \n Engage your right thigh muscles and draw your right femur into its socket. \nExtend yourright hand towards \nthe front of the room, keeping your right hip tucked \n Lower your right hand down onto your shin or ankle. And take your palm \nbesides ofyour right foot on the \nmat and hold this pose. \n The left shoulder stacks on top of the right one as you open your chest, \nreaching yourleft fingertips towards \nthe ceiling. \n Turn your head to take your gaze up towards your left fingertips. \n Continue to draw your right thigh muscles upward, deepening the crease in \nyour righthip. \n Soften your right knee slightly to prevent hyperextension. \n Stay for at least for 5 breaths. \n Repeat this pose with the left leg. \nBENEFITS: \n Strengthens the legs and stretches the groin, hamstrings and hips. \n It opens the chest musclesand shoulders. \n It improves balance and stability. \nCONTRADICTIONS: \nAvoid this pose if you have an injury to your back and neck, hips or shoulders. \nYou may wish toavoid it if you have \nheadache or migraine. \nPADAHASTASANA (HANDS TO THE FEET \nPOSE) \n\f \nINSTRUCTIONS: \n• Stand in Tadasana. \n• Inhale and raise your hands up over the head. \n• Exhale and bend forward keeping your hands and back in one line, without \nbending your knees or hunching the back. \n• Try to place the abdomen, chest close to the thigh and knees, placing your \npalms beside the feet. \n• After a few breaths, breathe inhale and rise up, relax hands. \nPaschimottanasana (back stretching pose) \n \nSit on the floor with the legs outstretched, feet together and hands on the knees.This is the \nstarting position. \nRelax the whole body. \nSlowly bend forward from the hips, sliding the hands \ndown the legs. Try to grasp the big toes with the fingers \nand thumbs. If this is impossible, hold the heels, ankles or \nany part of the legs that can be reached comfortably. \nMove slowly without forcing or jerking. \nHold the position for a few seconds. Relax the back and \nleg muscles allowing them to gently stretch. \nKeeping the legs straight and utilising the arm muscles, \nnot the back muscles, begin to bend the elbows and gently \nbring the trunk down towards the legs, maintaining a firm \n\fgrip on the toes, feet or legs. \nTry to touch the knees with the forehead. Do not strain. \nThis is the final position. \nHold the position for as long as is comfortable and relax. \nSlowly return to the starting position. \nThis is one round. \nBreathing: Inhale in the starting position. \nExhale slowly while bending forward. \nInhale in the static position. \nExhale while bringing the trunk further towards the legs \nwith the arms. \nBreathe slowly and deeply in the final position or retain \nthe breath out if holding for a short duration. \nInhale while returning to the starting position. \nDuration: Beginners should perform up to 5 rounds, staying \nin the final position for only a short length of time. Adepts \nmay maintain the final position for up to 5 minutes. \nAwareness: Physical - on the abdomen, relaxation of the back \nmuscles or the slow breathing process. \nSpiritual - on swadhisthana chakra. \nSequence: This asana should precede or follow backward \nbending asanas such as setuasana, chakrasana, bhujangasana \nor matsyasana. \nContra-indications: People who suffer from slipped disc or \nsciatica should not practise paschimottanasana. \nBenefits: This asana stretches the hamstring muscles and \nincreases flexibility in the hip joints. It tones and massages \nthe entire abdominal and pelvic region including the liver, \npancreas, spleen, kidneys and adrenal glands. It removes \nexcess weight in this area and helps alleviate disorders of \nthe uro-genital system. It stimulates circulation to the \nnerves and muscles of the spine. It is used in yoga therapy \nfor the management of prolapse, menstrual disorders, \nsluggish liver, diabetes, colitis, kidney complaints, bronchitis \nand eosinophilia. \nMeditation Asanas (5 meditative pose) \nThe main purpose of the meditation asanas is to allow the \npractitioner to sit for extended periods of time without moving \nthe body and without discomfort. Only when the body has \nbeen steady and still for some time will meditation be \nexperienced. Deep meditation requires the spinal column to \nbe straight and very few asanas can satisfy this condition. \nFurthermore, in high stages of meditation the practitioner \nloses control over the muscles of the body. The meditation \nasana, therefore, needs to hold the body in a steady position \nwithout conscious effort. Why not lie in shavasana, then, for \nmeditation since it satisfies all the requirements? Because in \nshavasana there is a tendency to drift into sleep. It is essential \nto remain awake and alert while going through the various \n\fstages which lead to successful meditation. \nSwami Sivananda of Rishikesh said the following about \nasanas and meditation: \"You must be able to sit in one of the \nmeditation asanas for a full three hours at a stretch without \nthe body shaking. Then only will you gain true asana siddhi, \nmastery over the asana, and be able to practise the higher \nstages of pranayama and dhyana. Without securing a steady \nasana you cannot progress well in meditation. The more \nsteady you are in your asana, the more you will be able to \nconcentrate with a one-pointed mind. If you can be steady in \na posture even for one hour, you will be able to acquire a onepointed \nmind and feel the atmic anandam, infinite peace and \nsoulful bliss inside you.\" \n \nPrecautions: If there is severe discomfort or pain in the \nlegs after sitting for some time in a meditation asana, slowly \nunlock the legs and massage them. When the blood circulation \nhas returned to normal and there is no pain, resume the \nasana. However, be aware that the knee is a very delicate and \nmuch abused joint of the body and be careful not to strain it, \nespecially while moving into or out of these meditation asanas. \nDo not on any account use undue force or strain to sit in a \nmeditation asana. \nRight or left leg: In all the asanas discussed in this chapter, \neither the left or the right leg may be placed uppermost. It is \na matter of personal preference and depends on whichever is \nthe more comfortable. Ideally, the leg position should be \nalternated so that the balance on both sides of the body is \nmaintained. \nPractice note: A useful suggestion to make the following \npostures more comfortable is to place a small cushion under \nthe buttocks. \n \nSUKHASANA \n \nSukhasana (easy pose) \n\fSit with the legs straight in front of the body. \nBend the right leg and place the foot under the left thigh. \nBend the left leg and place the foot under the right thigh. \nPlace the hands on the knees in chin or jnana mudra. \nKeep the head, neck and back upright and straight, but \nwithout strain. Close the eyes. \nRelax the whole body. The arms should be relaxed and \nnot held straight. \nBenefits: Sukhasana is the easiest and most comfortable of the \nmeditation postures. It can be utilised without ill effect by \npersons who are unable to sit in the more difficult meditation \npostures. It facilitates mental and physical balance \nwithout causing strain or pain. \nPractice note: Sukhasana is a relaxing posture which may be \nused after extended periods of sitting in siddhasana or \npadmasana. \nAlthough sukhasana is said to be the simplest meditation \nposture, it is difficult to sustain for long periods of time \nunless the knees are close to the ground or on the ground. \nOtherwise most of the body weight is supported by the \nbuttocks and backache develops. The other meditation \nasanas create a larger and, therefore, steadier area of \nsupport. \nVariation: For those who are extremely stiff, sukhasana may \nbe performed sitting cross-legged with a belt or cloth tied \naround the knees and lower back. \nHold the spine upright. \nConcentrate on the physical balance and equalising the \nweight on the right and left side of the body. A light, \nspacey feeling may be experienced. \nWhile maintaining the posture, place the hands on the \nknees in chin or jnana mudra (see section on mudras). \n \nARDHA PADMASANA \n\f \nArdha Padmasana (half-lotus pose) \nSit with the legs straight in front of the body. \nBend one leg and place the sole of the foot on the inside \nof the opposite thigh. \nBend the other leg and place the foot on top of the opposite \nthigh. \n97 \nWithout straining, try to place the upper heel as near as \npossible to the abdomen. Adjust the position so that it is \ncomfortable. \nPlace the hands on the knees in either chin or jnana \nmudra. \nKeep the back, neck and head upright and straight. \nClose the eyes and relax the whole body. \nContra-indications: Those who suffer from sciatica or sacral \nailments should not perform this asana. \nBenefits: The same as for padmasana but at a reduced level. \nPADMASANA \n\f \nPadmasana (lotus pose) \nSit with the legs straight in front of the body. \nSlowly and carefully bend one leg and place the foot on \ntop of the opposite thigh. \nThe sole should face upward and the heel should be close \nto the pubic bone. \nWhen this feels comfortable, bend the other leg and place \nthe foot on top of the opposite thigh. \nBoth knees should, ideally, touch the ground in the final \nposition. \nThe head and spine should be held upright and the \nshoulders relaxed. \nPlace the hands on the knees in chin or jnana mudra. \nRelax the arms with the elbows slightly bent and check \nthat the shoulders are not raised or hunched. \nClose the eyes and relax the whole body. \nObserve the total posture of the body. Make the necessary \nadjustments by moving forward or backward until balance \nand alignment are experienced. Perfect alignment indicates \nthe correct posture of padmasana. \nContra-indications: Those who suffer from sciatica, sacral \ninfections or weak or injured knees should not perform \nthis asana. This asana should not be attempted until \nflexibility of the knees has been developed through practice \nof the pre-meditation asanas. \nBenefits: Padmasana allows the body to be held completely \nsteady for long periods of time. It holds the trunk and \nhead like a pillar with the legs as the firm foundation. As \nthe body is steadied the mind becomes calm. This steadiness \nand calmness is the first step towards real meditation. \nPadmasana directs the flow of prana from mooladhara \nchakra in the perineum, to sahasrara chakra in the head, \nheightening the experience of meditation. \n\fThis posture applies pressure to the lower spine which has \na relaxing effect on the nervous system. The breath \nbecomes slow, muscular tension is decreased and blood \npressure is reduced. The coccygeal and sacral nerves are \ntoned as the normally large blood flow to the legs is \nredirected to the abdominal region. This activity also \nstimulates the digestive process. \n \nSIDDHASANA \n \nSiddhasana (accomplished pose for men) \nSit with the legs straight in front of the body. \nBend the right leg and place the sole of the foot flat \nagainst the inner left thigh with the heel pressing the \nperineum (the area midway between the genitals and the \nanus), sitting on top of the right heel. \nThis is an important aspect of siddhasana. \nAdjust the body until it is comfortable and the pressure of \nthe heel is firmly applied. \nBend the left leg and place the left ankle directly over the \nright ankle so that the ankle bones are touching and the \nheels are one above the other. \nPress the pubis with the left heel directly above the genitals. \nThe genitals will, therefore, lie between the two heels. \nIf this last position is too difficult, simply place the left \n\fheel as near as possible to the pubis. \nPush the toes and the outer edge of the left foot into the \nspace between the right calf and thigh muscles. If necessary, \nthis space may be enlarged slightly by using the hands or \ntemporarily adjusting the position of the right leg. \n100 \nGrasp the right toes and pull them up into the space \nbetween the left calf and thigh. \nAgain adjust the body so that it is comfortable. \nThe legs should now be locked, with the knees touching \nthe ground and the left heel directly above the right heel. \nMake the spine erect and feel as though the body is fixed \non the floor. Place the hands on the knees in jnana, chin \nor chinmaya mudra. \nClose the eyes and relax the whole body. \nContra-indications: Siddhasana should not be practised by \nthose with sciatica or sacral infections. \nBenefits: Siddhasana directs the energy from the lower psychic \ncentres upward through the spine, stimulating the brain \nand calming the entire nervous system. The position of \nthe lower foot at the perineum presses mooladhara chakra, \nstimulating moola bandha, and the pressure applied to \nthe pubic bone presses the trigger point for swadhisthana, \nautomatically activating vajroli/sahajoli mudra. These two \npsycho-muscular locks redirect sexual nervous impulses \nback up the spinal cord to the brain, establishing control \nover the reproductive hormones which is necessary in \norder to maintain brahmacharya for spiritual purposes. \nProlonged periods in siddhasana result in noticeable \ntingling sensations in the mooladhara region which may \nlast for ten to fifteen minutes. This is caused by a reduction \nin the blood supply to the area and by a rebalancing of the \npranic flow in the lower chakras. \nThis posture redirects blood circulation to the lower spine \nand abdomen, toning the lumbar region of the spine, the \npelvis and the abdominal organs, and balancing the \nreproductive system and the blood pressure. \nPractice note: Siddhasana may be performed with either leg \nuppermost. Many people experience discomfort due to \nthe pressure applied where the ankles cross each other. If \nnecessary, place a folded cloth or piece of sponge between \nthe legs at this point. At first the pressure at the perineum \nmay be uncomfortable to maintain but with practice this \nwill be eased. \nNote: The Sanskrit word siddha means 'power' and 'perfection'. \nThe word siddhi is derived from siddha and refers to a psychic \npower or faculty developed through yogic practices. Siddhis \ninclude clairvoyance and telepathy as well as many other lesser \nknown powers such as the ability to disappear at will. Siddhasana, \nor siddha yoni asana for women, is believed to be the asana that \nhelps develop these powers. \n\fSIDDHA YONI ASANA \n \nSiddha Yoni Asana (accomplished pose for women) \nSit with the legs straight in front of the body. \nBend the right leg and place the sole of the foot flat \nagainst the inner left thigh. \nPlace this heel firmly against or inside the labia majora of \nthe vagina. \nAdjust the body position so that it is comfortable while \nsimultaneously feeling the pressure of the right heel. \nBend the left leg and place the left heel directly on top of \nthe right heel so it presses the clitoris, and wedge the left \ntoes down into the space between the calf and thigh so \nthey touch, or almost touch, the floor. \nGrasp the toes of the right foot and pull them up into the \nspace between the left calf and thigh. \nAgain, adjust the position so that it is comfortable. \nEnsure that the knees are firmly on the ground. \nMake the spine fully erect and straight as though it were \nplanted solidly in the earth. \nPlace the hands on the knees is chin, jnana or chinmaya \nmudra. \nClose the eyes and relax the whole body. \nContra-indications: As for siddhasana. \nBenefits: As for siddhasana. \n\fNote: The Sanskrit word yoni means womb' or 'source'. \n \nSWASTIKASANA \nSwastikasana (auspicious pose) \nSit with the legs straight in front of the body. \nBend the left knee and place the sole of the left foot \nagainst the inside of the right thigh, so there is no contact \nbetween the heel and the perineum. \nBend the right knee and place the right foot in the space \nbetween the left thigh and calf muscle, so there is no \ncontact between the heel and the pubis. \nGrasp the toes of the left foot and pull them up into the \nspace between the right calf and thigh. \nAdjust the position so that it is comfortable. The knees \nshould be firmly on the floor. \nStraighten the spine. \nPlace the hands on the knees in chin, jnana or chinmaya \nmudra. \nVariation: Sit with the legs straight in front of the body. \nBend the left leg, place the sole against the inside of the \nright thigh. \nSimilarly, bend the right leg and place the heel of the \nright foot on the floor in front of the left foot with the sole \nresting against the left shin. The heels will now be one in \nfront of the other. \nThe hands may be placed on the knees in jnana, chin or \nchinmaya mudra, or they may be placed on the lap. \nClose the eyes and relax the whole body. \nContra-indications: Swastikasana should not be performed by \npeople with sciatica or sacral infections. \nBenefits: Swastikasana is a healthy position to sit in especially \nfor those suffering from varicose veins, tired and aching \nmuscles or fluid retention in the legs. \nPractice note: This is the easiest classical meditation asana \nand is a simplified version of siddhasana. \nNote: Here the symbol of the swastika represents the different corners \nof the earth and universe, the spokes, and their meeting point and \ncommon centre of consciousness. This asana may be regarded as \nthe one most favourable for realising the unity of existence. \n \nARDHA MATSYENDRASANA \n\f \nArdha Matsyendrasana (half spinal twist) \nSit with the legs stretched out in front of the body. \nBend the right leg and place the right foot flat on the floor \non the outside of the left knee. \nThe toes of the right foot should face forward. \nBend the left leg and bring the foot around to the right \nbuttock. The outside edge of the foot should be in contact \nwith the floor. \nPass the left arm through the space between the chest and \nthe right knee, and place it against the outside of the right \nleg- \nHold the right foot or ankle with the left hand, so that the \nright knee is close to the left armpit. \nSit up as straight as possible. \nRaise the right arm in front of the body and gaze at the \nfingertips. \nSlowly twist to the right, simultaneously moving the arm, \ntrunk and head. \nUse the left arm as a lever against the right leg to twist the \ntrunk as far as possible without using the back muscles. \nFollow the tips of the fingers of the right hand with the \ngaze and look over the right shoulder. \nDo not strain the back. \nBend the right elbow and place the arm around the back \nof the waist. The back of the right hand should wrap \naround the left side of the waist. \nAlternatively, it can be placed as high as possible between \nthe shoulder blades with the fingers pointing up. This \narm position enforces the straightness of the spine. \nReverse the movements to come out of the posture and \nrepeat on the other side. \nBreathing: Inhale in the forward position. \nExhale while twisting the trunk. \nBreathe deeply and slowly without strain in the final \nposition. \nInhale while returning to the starting position. \nDuration: Practise once on each side, gradually increasing the \nholding time to 1 or 2 minutes on each side of the body or \n\fup to 30 breaths. \nAwareness: Physical - on keeping the spine straight and on \nthe movement of the abdomen created by the breath in \nthe final position. \nSpiritual - on ajna chakra. \nSequence: This asana should be performed after completing a \nseries of forward and backward bending asanas. \nContra-indications: Women more than two or three months \npregnant should avoid this practice. People suffering from \npeptic ulcer, hernia or hyperthyroidism should only practise \nthis pose under expert guidance. \nPeople with sciatica or slipped disc may benefit from this \nasana, but great care should be taken. \nBenefits: This asana simultaneously stretches the muscles on \none side of the back and abdomen while contracting the \nmuscles on the other side. It tones the nerves of the spine, \nmakes the back muscles supple, relieves lumbago and \nmuscular spasms, and reduces the tendency of adjoining \nvertebrae to develop osteophytes. When practised with \ncare, it has proved beneficial for mild cases of slipped disc. \nArdha matsyendrasana massages the abdominal organs, \nalleviating digestive ailments. It regulates the secretion of \nadrenaline and bile and is recommended in the yogic \nmanagement of diabetes. Under special guidance it is \nused for the yogic management of sinusitis, hay fever, \nbronchitis, constipation, colitis, menstrual disorders, \nurinary tract disorders and cervical spondylitis, as long as \nit can be performed without any discomfort. \nVariation: For beginners and those with stiff bodies the following \nadjustments to the position may be made: \nThe leg that is placed by the side of the buttock should \nremain straight and the hand holding the ankle may be \nwrapped around the opposite thigh, hugging the knee to \nthe chest. \nBHUJANGASANA (COBRA POSE) \n \nINSTRUCTIONS: \n Keep the hands and feet in place. \n Slide the chest forward and raise first the head, the shoulders, then, \nstraightening the elbows, arch the back into the \n\fcobra pose. \n This will lower the buttocks and hips to the floor. \n Bend the head back and direct the gaze upward to the eyebrow centre. \n The thighs and hips remain on the floor and the arms support the trunk. \n Unless the spine is very flexible the arms will remain slightly bent. \nBENEFITS OF BHUJANGASANA: \n It deepens the breath. \n It helps in removing backache. \n It keeps the spine flexible and healthy. \n It tones the liver, kidneys, ovaries, and uterus. \nCONTRADICTION OF BHUJANGASANA: \n Avoid if one is suffering from peptic ulcers or Hernia. \n Pregnant woman should avoid this practice. \n \nDHANURASANA (BOW POSE) \n \nINSTRUCTIONS: \n Lie flat on the stomach with the legs and feet together, and the arms and \nhands beside the body. \n Bend the knees and bring the heels close to the buttocks. Grasp the ankles \nwith the hands. \n Keep the knees and thighs firmly on the floor and the arms straight throughout \nthe practice. \n Place the chin on the floor. \n This is the starting position. \n Tense the legs and push the feet backwards while raising the head and chest \nas high as possible from the floor \nwithout straining. \n Use the backward movement of the legs to assist the raising of the body, \nallowing the back muscles to remain \npassive. \n In the final position the head is tilted back. \n Hold the final position for as long as is comfortable. \n Slowly lower the chest and head to the ground by releasing the legs. \n\f Relax in the prone position until the respiration returns to normal. This is one \nround. \nBENEFITS OF DHANURASANA: \nThe same benefits as for Dhanurasana, but at decreased levels. \n It is useful for lower back pain due to slipped disc or cervical spondylitis when it \ncan be performed without discomfort. \n It tones the heart and lungs and is beneficial for respiratory disorders. It helps \nto improve the posture. \nCONTRADICTION OF DHANURASANA: \n People who suffer with heart problems, high blood pressure should avoid it. \n A person suffering from Hernia, peptic ulcers or duodenal ulcers, appendicitis \nand the other abdominal ailments \nshould not do this asana. \n \nHALASANA \n \nHalasana (plough pose) \nLie flat on the back with the legs and feet together. Place \nthe arms beside the body with the palms facing down. \nRelax the whole body. \nRaise both legs to the vertical position, keeping them \nstraight and together, using only the abdominal muscles. \nPress down on the arms and lift the buttocks, rolling the \nback away from the floor. Lower the legs over the head. \nTry to touch the toes to the floor behind the head. \nDo not force the toes to touch the floor. \nTurn the palms up, bend the elbows and place the hands \nbehind the ribcage to support the back as in sarvangasana. \nRelax and hold the final pose for as long as is comfortable. \nReturn to the starting position by lowering the arms with \nthe palms facing down, then slowly lower the back and \nbuttocks to the floor. \n\fRaise the legs to the vertical position. Using the abdominal \nmuscles, lower the legs to the starting position, keeping \nthe knees straight. \nBreathing: Inhale while in the lying position. \nRetain the breath inside while assuming the final pose. \nBreathe slowly and deeply in the final pose. \nRetain the breath inside while returning to the starting \nposition. \nDuration: Beginners should hold the pose for 15 seconds, \ngradually adding a few seconds per week until it can be \nheld for one minute. \nAdepts may hold the final pose up to 10 minutes or longer. \nAwareness: Physical - on the abdomen, relaxation of the back \nmuscles, the respiration or the thyroid gland. \nSpiritual - on manipura or vishuddhi chakra. \nSequence: If possible, perform this asana immediately after \nsarvangasana. To go from sarvangasana to halasana, bring \nthe feet slightly over the head for balance, slowly remove \nthe arms from their position behind the back and place \nthem on the floor in the starting position, palms facing \ndown. Relax the body and slowly lower the legs over the \nhead, keeping them straight and together, until the toes \ntouch the floor. Keep the legs straight and continue as \ndescribed above. \nFollow halasana with either matsyasana, ushtrasana or \nsupta vajrasana as a counterpose, practised for half the \ncombined duration of sarvangasana and halasana. It may \nalso be followed by the variations for halasana given at the \nend of this chapter. Halasana is a good preparatory practice \nfor paschimottanasana. \nContra-indications: This asana should not be practised by those \nwho suffer from hernia, slipped disc, sciatica, high blood \npressure or any serious back problem, especially arthritis \nof the neck. \nBenefits: The movement of the diaphragm which takes place \nduring the practice of halasana massages all the internal \norgans, activates the digestion, relieving constipation and \ndyspepsia, revitalises the spleen and the suprarenal glands, \npromotes the production of insulin by the pancreas and \nimproves liver and kidney function. It strengthens the \nabdominal muscles, relieves spasms in the back muscles, \ntones the spinal nerves, improving the operation of the \nsympathetic nervous system, and increases blood circulation \nto the whole area. It regulates the activities of the \nthyroid gland which balances the body's metabolic rate, \nand stimulates the thymus gland, boosting the immune \nsystem. \nIt is used in yoga therapy for the management of asthma, \nbronchitis, constipation, hepatitis, urinary tract and \nmenstrual disorders. \n \n\fSARVANGASANA (SHOULDER STAND) \n \nSarvangasana, shoulder stand or more fully Salamba Sarvangasana, is an \ninverted pose. The word 'Sarvang' means \nentire body. From the final position of asana, it can be deduced that ithas a \nfavorable effect on entire body. It is \nstrongly recommended to attempt this posture only after a few weeks of initial \ntraining. \nBENEFITS: \n● It stimulates the thyroid and parathyroid glands and normalizes their functions. \n● It preserves the youth by keeping the spine elastic. \n● It cures constipation, indigestion, diabetes, varicose veins and menstrual \ndisorders. \n● It helps in achieving perfect health. \nCONTRADICTIONS: \n Practitioners suffering from abnormal blood pressure, glaucoma, detached \nretina, chronic thyroid disorders, \nand neck or shoulder injuries should avoid this asana. Practice only after \nconsulting the trained yoga \npractitioner. \n \n \nSIRSHASANA \n\f \nSirshasana (headstand pose) \nStage I: Sit in vajrasana. \nClose the eyes and relax the whole body. \nAfter a few minutes, open the eyes, bend forward and \nplace the forearms on a folded blanket with the fingers \ninterlocked and the elbows in front of the knees. \nThe distance between the elbows should be equal to the \ndistance from each elbow to the interlocked fingers, \nforming an equilateral triangle. \nPlace the crown of the head on the blanket between the \ninterlocked fingers. Wrap the hands around the head to \nmake a firm support so that it cannot roll backward when \npressure is applied. \nStage 2: Lift the knees and buttocks off the floor and straighten \nthe legs. \nStage 3: Slowly walk the feet as close as possible towards the \ntrunk and head, gradually moving the back towards the \nvertical position. \nBend the knees slightly, press the thighs against the \nabdomen and lower chest. \nTransfer the body weight slowly from the toes onto the \nhead and arms, maintaining a steady balance. \n\fRaise one foot off the floor about 20 cm, carefully balance, \nthen raise the other foot and balance on the head and \narms. \nStage 4: Bending the knees, gradually raise the calves in a \ncontrolled movement. Adjust the trunk slightly to counterbalance \nthe weight of the legs. \nFold the legs back so the heels move towards the buttocks. \nTo accomplish this movement contract the muscles of the \nlower back. The knees are now pointing down with the \nlegs together. \nMaintain the position for a few seconds, being aware of \ncomplete balance before proceeding. \nStage 5: Raise the knees to the vertical position. Keeping the \nheels near the buttocks, slowly straighten the hips so that \nthe thighs move up and away from the torso. \nRaise the knees until they point directly upward and the \nthighs are in line with the trunk. \nBalance the body. \nStage 6: Slowly straighten the knees and raise the calves. \nThe whole body should be in one straight line with the \nfeet relaxed. \nThis is the final position. \nClose the eyes and balance the whole body, relaxing in the \nfinal position for as long as is comfortable. \nStage 7: Return to the starting position. \nSlowly bend the knees and lower the body with control in \nthe reverse order until the toes touch the floor. Remain \nwith the head on the ground in the kneeling position for \na short time, then slowly return to the upright position. \n \nBreathing: Inhale at the end of stage 1. \nRetain the breath inside while raising the body into the \nfinal position. Beginners may practise normal breathing \nwhile coming into the posture. \nBreathe normally in the final position. The breath should \nbecome increasingly subtle in this posture as one becomes \naccustomed to it. \nDuration: Beginners should start by holding the pose for 30 \nseconds, gradually adding about 1 minute per week until \nthe desired period is reached. 3 to 5 minutes spent in the \nfinal position is sufficient for general health, however, \nsirshasana may be practised by experts for periods of up \nto 30 minutes. \nAwareness: Physical - for beginners, on maintaining balance. \nFor adepts, on the brain, centre of the head or respiration. \nSpiritual - on sahasrara chakra. \nSequence: While beginners should practise sirshasana at the \nend of their asana programme, more experienced practitioners \nmay perform it either at the beginning or the end. \nIt should be followed by tadasana, as a counterpose, and \nthen shavasana. \n\fContra-indications: Sirshasana should not be practised by \npeople with high blood pressure, heart disease, thrombosis, \narteriosclerosis, chronic catarrh, chronic constipation, \nkidney problems, impure blood, severe near-sightedness, \nweak eye blood vessels, conjunctivitis, chronic glaucoma, \ninflammation of the ears or any form of blood haemorrhage \nin the head; neither should it be practised during pregnancy \nor menstruation. Although it is recommended as a \npreventative measure for headache or migraine, it should \nnot be practised during either. \nBenefits: This asana is very powerful for awakening sahasrara \nchakra and, therefore, it is considered the greatest of all \nasanas. \nSirshasana increases the blood flow to the brain and \npituitary gland, revitalising the entire body and mind. It \nrelieves anxiety and other psychological disturbances which \nform the root cause of many disorders. It is, therefore, \nrecommended for the prevention of asthma, hay fever, \ndiabetes and menopausal imbalance. It also helps to rectify \nmany forms of nervous and glandular disorder, especially \nthose related to the reproductive system. \nThis asana reverses the effect of gravity on the spine. \nStrain on the back is thus alleviated and the reversed flow \nof blood in the legs and visceral regions aids tissue \nregeneration. The weight of the abdominal organs on the \ndiaphragm encourages deep exhalation so that larger \namounts of carbon dioxide, toxins and bacteria are \nremoved from the lungs. \nPractice note: In the final position, most of the weight of the \nbody is sustained by the top of the head, the arms being \nused to maintain balance only. Beginners, however, may \nuse the arms as support until the neck is strong enough to \nbear the full weight of the body, and a reasonable sense of \nbalance has been developed. \nIf the practitioner should fall during the practice, the \nbody should be as relaxed as possible. If the fall is forward, \ntry to fold the knees into the chest so that the impact on \nthe floor is sustained by the feet. If falling backwards, arch \nthe back, again so that the feet sustain the impact. \n \n \nSurya Namaskara \n\f \n \nSALUTATIONS TO THE SUN \nThe Sanskrit name surya here refers to the sun and namaskara \nmeans 'salutations'. Surya namaskara has been handed down \nfrom the enlightened sages of the Vedic Age. The sun symbolises \nspiritual consciousness and, in ancient times, was \nworshipped on a daily basis. In yoga the sun is represented by \npingala or surya nadi, the pranic channel which carries the \nvital, life-giving force. \nThis dynamic group of asanas is not regarded as being a \ntraditional part of hatha yoga practices as it was added to the \noriginal asana group at a later time. However, it is an effective \nway of loosening up, stretching, massaging and toning all the \njoints, muscles and internal organs of the body. Its versatility \nand application make it one of the most useful methods of \ninducing a healthy, vigorous and active life while, at the same \ntime, preparing for spiritual awakening and the resulting expansion \nof awareness. \nSurya namaskara is a complete sadhana, spiritual practice, \nin itself for it includes asana, pranayama, mantra and \nmeditation techniques. It is an excellent group of asanas with \nwhich to start morning practice. Surya namaskara has a direct \nvitalising effect on the solar energy of the body which flows \nthrough pingala nadi. Regular practice of surya namaskara \nregulates pingala nadi, whether it is under-active or overactive. \nRegulation of pingala nadi leads to a balanced energy \nsystem at both mental and physical levels. \nSurya namaskara is composed of three elements: form, \n\fenergy and rhythm. The twelve asanas are the physical matrix \naround which the form of the practice is woven. These asanas \ngenerate prana, the subtle energy which activates the psychic \nbody. Their performance, in a steady, rhythmic sequence, \nreflects the rhythms of the universe; the twenty-four hours of \nthe day, the twelve zodiac phases of the year and the biorhythms \nof the body. The application of this form and rhythm to the \nbody/mind complex generates the transforming force which \nproduces a fuller and more dynamic life. \nTime of practice: The ideal time to practise surya namaskara \nis at sunrise, the most peaceful time of day. Whenever possible, \npractise in the open air, facing the rising sun. Sunset is also a \ngood time to practise as it stimulates the digestive fire. Surya \nnamaskara, however, may be practised at any time provided \nthe stomach is empty. \nPreparation: Before commencing the practice, stand with \nthe feet together or slightly apart, and the arms hanging \nloosely by the side of the body. Close the eyes gently and \nbecome aware of the whole physical body as one homogeneous \nunit. In this position the body may sway from side to side \nor backward and forward. Try to minimise this oscillation and \nbalance the body weight equally on both feet. \nBring the awareness inside the body and mentally begin to \nrelax it. Starting from the top of the head, take the awareness \nsystematically through all the parts, releasing any tension. \nIntensify, once more, the awareness of the whole physical \nbody and feel in harmony with it. \nTake the awareness to the soles of the feet in contact with \nthe floor. Feel that the whole body is being pulled downwards \nby gravity and that any tensions are being pulled down, \nthrough the body and into the ground. At the same time, \nexperience the vital force surging up from the earth and \nflooding the whole being. \nFinally, take the awareness to the eyebrow centre and visualise \na brilliant, red rising sun infusing the whole body and \nmind with its vitalising and healing rays. Imagine you are \nfacing the early morning sunrise, about to practise surya \nnamaskara with smooth synchronised movements, flowing into \none another like a dance. \nPosition 1: Pranamasana (prayer pose) \nThis is the final position and is the same as position 1. \nBring the palms together in front of the chest. \nBreathing: Exhale while assuming the final position. \nAwareness: Physical - on the region of the heart. \nSpiritual - on anahata chakra. \nMantra: Om Mitraye Namaha. \nHASTA UTTHANASANA \nPosition 2: Hasta Utthanasana (raised arms pose) \nRaise and stretch both arms above the head. \nKeep the arms separated, shoulder width apart. \nBend the head, arms and upper trunk backward. \n\fBreathing: Inhale while raising the arms. \nAwareness: Physical - on the stretch of the abdomen and \nexpansion of the lungs. \nSpiritual - on vishuddhi chakra. \nMantra: Om Ravaye Namaha, salutations to the shining one. \nBenefits: This pose stretches all the abdominal organs and \nimproves digestion. It exercises the arm and shoulder \nmuscles, tones the spinal nerves, opens the lungs and \nremoves excess weight. \n \nPADAHASTASANA \nPosition 3: Padahastasana (hand to foot pose) \nBend forward until the fingers or palms of the hands \ntouch the floor on either side of the feet. \nTry to touch the knees with the forehead. \nDo not strain. \nKeep the knees straight. \nBreathing: Exhale while bending forward. \nTry to contract the abdomen in the final position to expel \nthe maximum amount of air from the lungs. \nAwareness: Physical - on the pelvic region. \nSpiritual - on swadhisthana chakra. \nMantra: Om Suryaya Namaha, salutations to he who induces \nactivity. \nContra-indications: People with back conditions should not \nbend forward fully. Bend from the hips, keeping the spine \nstraight, until the back forms a ninety degree angle with \nthe legs, or bend only as far as comfortable. \nBenefits: This pose is useful in eliminating or preventing \nstomach or abdominal ailments. It reduces excess weight \nin the abdominal region, improves digestion and helps to \nremove constipation. It improves blood circulation, makes \nthe spine supple and tones the spinal nerves. \n \nASHWA SANCHALANASANA \nPosition 4: Ashwa Sanchalanasana (equestrian pose) \nPlace the palms of the hands flat on the floor beside the \nfeet. \nStretch the right leg back as far as possible. \nAt the same time, bend the left knee, keeping the left foot \non the floor in the same position. Keep the arms straight. \nIn the final position, the weight of the body should be \nsupported on both hands, the left foot, right knee and \ntoes of the right foot. The head should be tilted backward, \nthe back arched and the inner gaze directed upward to \nthe eyebrow centre. \nBreathing: Inhale while stretching the right leg back. \nAwareness: Physical - on the stretch from the thigh to the \nchest or on the eyebrow centre. \nSpiritual - on ajna chakra. \nMantra: Om Bhanave Namaha, salutations to he who illumines. \n\fBenefits: This pose massages the abdominal organs and improves \ntheir functioning, strengthens the leg muscles and \ninduces balance in the nervous system. \nPractice note: In the final pose the palms of the hands should \nbe flat on the floor initially. Later on, more advanced \npractitioners may come up onto the fingertips. \nPARVATASANA \nPosition 5: Parvatasana (mountain pose) \nTake the left foot back beside the right foot. \nSimultaneously, raise the buttocks and lower the head \nbetween the arms, so that the back and legs form two sides \nof a triangle. \nThe legs and arms should be straight in the final position. \nTry to keep the heels on the floor in the final pose and \nbring the head towards the knees. \nDo not strain. \nBreathing: Exhale while taking the left leg back. \nAwareness: Physical - on relaxing the hips or on the throat \nregion. \nSpiritual - on vishuddhi chakra. \nMantra: Om Khagaya Namaha, salutations to he who moves \nquickly in the sky. \nBenefits: This pose strengthens the nerves and muscles in the \narms and legs. The spinal nerves are toned and circulation \nis stimulated especially in the upper spine, between the \nshoulder blades. \nASHTANGA NAMASKARA \nPosition 6: Ashtanga Namaskara (salute with eight parts or \npoints) \nLower the knees, chest and chin to the floor. \nIn the final position only the toes, knees, chest, hands and \nchin touch the floor. The knees, chest and chin should \ntouch the floor simultaneously. If this is not possible, first \nlower the knees, then the chest, and finally the chin. \nThe buttocks, hips and abdomen should be raised. \nBreathing: The breath is held outside in this pose. There is no \nrespiration. \nAwareness: Physical - on the abdominal region. \nSpiritual - on manipura chakra. \nMantra: Om Pushne Namaha, salutations to the giver of strength. \nBenefits: This pose strengthens the leg and arm muscles, \ndevelops the chest and exercises the region of the spine \nbetween the shoulder blades. \nBHUJANGASANA \nPosition 7: Bhujangasana (cobra pose) \nLower the buttocks and hips to the floor, \nStraightening the elbows, arch the back and push the \nchest forward into the cobra pose. \nBend the head back and direct the gaze upward to the \neyebrow centre. \nThe thighs and hips remain on the floor and the arms \n\fsupport the trunk. \nUnless the spine is very flexible the arms will remain \nslightly bent. \nBreathing: Inhale while raising the torso and arching the back. \nAwareness: Physical - on relaxation of the spine. \nSpiritual - on swadhisthana chakra. \nMantra: Om Hiranya Garbhaya Namaha, salutations to the golden, \ncosmic self. \nBenefits: This pose keeps the spine supple, improving circulation \nin the back region and toning the spinal nerves. It \ntones the reproductive organs, stimulates digestion and \nrelieves constipation. It also tones the liver and massages \nthe kidneys and adrenal glands. \nPosition 8: Parvatasana (mountain pose) \nThis stage is a repeat of position 5. \nFrom bhujangasana assume parvatasana. \nThe hands and feet do not move from position 7. \nRaise the buttocks and lower the heels to the floor. \nBreathing: Exhale while raising the buttocks. \nAwareness: Physical - on relaxing the hips or on the throat \nregion. \nSpiritual - on vishuddhi chakra. \nMantra: Om Marichaye Namaha, salutations to the Lord of the \nDawn. \nPosition 9: Ashwa Sanchalanasana (equestrian pose) \nThis stage is the same as position 4. \nKeep the palms flat on the floor. \nBend the left leg and bring the left foot forward between \nthe hands. \nSimultaneously, lower the right knee so that it touches the \nfloor and push the pelvis forward. \nTilt the head backward, arch the back and gaze at the \neyebrow centre. \nBreathing: Inhale while assuming the pose. \nAwareness: Physical - on the stretch from the thigh to the \nchest, or on the eyebrow centre. \nSpiritual - on ajna chakra. \nMantra: Om Adityaya Namaha, salutations to the son of Aditi, \nthe cosmic Mother. \nPosition 10: Padahastasana (hand to foot pose) \nThis position is a repeat of position 3. \nBring the right foot forward next to the left foot. \nStraighten both knees. \nBring the forehead as close to the knees as possible without \nstraining. \nBreathing: Exhale while performing the movement. \nAwareness: Physical - on the pelvic region. \nSpiritual - on swadhisthana chakra. \nMantra: Om Savitre Namaha, salutations to Lord of Creation. \nPosition 11: Hasta Utthanasana (raised arms pose) \nThis stage is a repeat of position 2. \n\fRaise the torso and stretch the arms above the head. \nKeep the arms separated, shoulder width apart. \nBend the head, arms and upper trunk backward. \nBreathing: Inhale while straightening the body. \nAwareness: Physical - on the stretch of the abdomen and \nexpansion of the lungs. \nSpiritual - on vishuddhi chakra. \nMantra: Om Arkaya Namaha, salutations to he who is fit to be \npraised. \nPosition 12: Pranamasana (prayer pose) \nThis is the final position and is the same as position 1. \nBring the palms together in front of the chest. \nBreathing: Exhale while assuming the final position. \nAwareness: Physical - on the region of the heart. \nSpiritual - on anahata chakra. \nMantra: Om Bhaskaraya Namaha, salutations to he who leads to \nenlightenment. \nPositions 13-24: The twelve positions of surya namaskara are \npractised twice to complete one round. Positions 1 to 12 \nconstitute half a round. In the second half, the positions \nare repeated with two small changes: \na) In position 16, instead of stretching the right foot \nbackward, stretch the left foot back. \nb) In position 21, bend the right leg and bring the right \nfoot between the hands. \nConclusion: On the completion of each half round, lower \nthe arms to the side, relax the body and concentrate on \nthe breath until it returns to normal. After completing \nsurya namaskara, practise shavasana for a few minutes. \nThis will allow the heartbeat and respiration to return to \nnormal and all the muscles to relax. \nPractice note: In reference to position 4: when practising surya \nnamaskara for general or therapeutic purposes, begin by \nplacing the right leg back to activate pingala nadi as \ndescribed above; if practising for mental concentradon \nor for a more meditadonal effect, begin with the left leg \nwhich will activate ida nadi. \nBeeja mantras: As an alternative to the twelve names of the \nsun, there is a series of beeja mantras or seed syllables. \nBeeja mantras do not have any literal meaning but set up \npowerful vibrations of energy within the mind and body. \nThe beeja mantras are six in number and are repeated \nconsecutively in the following order, four times during a \ncomplete round of surya namaskara: \n1. Om Hraam 4. Om Hraim \n2. Om Hreem 5. Om Hraum \n3. Om Hroom 6. Om Hrah \nWhen surya namaskara is practised too fast to repeat the \nsun mantras, the beeja mantras may be used. \nDuration: For spiritual benefits, practise 3 to 12 rounds slowly. \nFor physical benefits, practise 3 to 12 rounds more quickly. \n\fBeginners should start with 2 or 3 rounds and add one \nmore round every few weeks to avoid fatigue. Advanced \nstudents may practise a larger number of rounds, however, \nstrain should be avoided at all times. In special cases, a \ndaily practice of 108 rounds may be undertaken for \npurification, but only under expert guidance. \nSequence: Surya namaskara is ideally practised before other \nasanas. \nContra-indications: The practice of surya namaskara should \nbe immediately discontinued if a fever, acute inflammation, \nboils or rashes occur. These may develop due to excess \ntoxins in the body. When the toxins have been eliminated, \nthe practice may be resumed. \nSurya namaskara should not be practised by people \nsuffering from high blood pressure, coronary artery \ndiseases, or by those who have had a stroke, as it may over \nstimulate or damage a weak heart or blood vessel system. \nIt should also be avoided in cases of hernia or intestinal \ntuberculosis. \nPeople with back conditions should consult a medical \nexpert before commencing this practice. Although some \nback conditions may be alleviated by this practice, \nconditions such as slipped disc and sciatica will be better \nmanaged through an alternative asana programme. \nDuring the onset of menstruation, this practice should be \navoided. If there are no adverse effects, the practice may \nbe resumed after the initial flow or towards the end of the \nperiod. During pregnancy it may be practised with care \nuntil the beginning of the twelfth week. Following childbirth, \nit may be commenced approximately forty days \nafter delivery for re-toning the uterine muscles. \nGeneral benefits: The practice of surya namaskara as a whole \ngives a great number of benefits. \nIt stimulates and balances all the systems of the body, \nincluding the endocrine, circulatory, respiratory and \ndigestive systems. Its influence on the pineal gland and \nthe hypothalamus helps to prevent pineal degeneration \nand calcification. This balances the transition period \nbetween childhood and adolescence in growing children. \nSynchronising the breath with the physical movements of \nsurya namaskara ensures that the practitioner, at least for \na few minutes daily, breathes as deeply and rhythmically \nas possible. This removes carbon dioxide from the lungs \nand replaces it with fresh oxygen, increasing mental clarity \nby bringing fresh, oxygenated blood to the brain. \nTo conclude, surya namaskara is the ideal practice to \nincrease awareness and bestow good health and wellbeing. \nNote: For more information on this practice see the Bihar School of \nYoga publication Surya Namaskara: A Technique of Solar \nRevitalization. \n \n",
        "summary": "The document outlines various yoga asanas, detailing their instructions, benefits, and contraindications. It covers individual poses like Vrikshasana (Tree Pose), Garudasana (Eagle Pose), Utthita Trikonasana (Extended Triangle Pose), Padahastasana (Hands to the Feet Pose), Paschimottanasana (Back Stretching Pose), Bhujangasana (Cobra Pose), Dhanurasana (Bow Pose), Halasana (Plough Pose), Sarvangasana (Shoulder Stand), and Sirshasana (Headstand Pose). Each of these poses aims to improve physical flexibility, strength, balance, and mental focus, while also providing specific therapeutic effects for various bodily systems and conditions.\n\nThe document also delves into Meditation Asanas, emphasizing their purpose in enabling practitioners to sit for extended periods without discomfort, maintaining an upright spine and alertness. It describes Sukhasana (Easy Pose), Ardha Padmasana (Half-Lotus Pose), Padmasana (Lotus Pose), Siddhasana (Accomplished Pose for men), Siddha Yoni Asana (Accomplished Pose for women), and Swastikasana (Auspicious Pose), highlighting their unique benefits for meditation, nervous system calming, and energy direction. Ardha Matsyendrasana (Half Spinal Twist) is also detailed, known for toning spinal nerves and abdominal organs.\n\nA significant portion is dedicated to Surya Namaskara (Salutations to the Sun), a dynamic sequence of twelve asanas performed as a complete spiritual practice involving asana, pranayama, mantra, and meditation. It is ideal for morning practice, regulating the body's solar energy, and stimulating all body systems. The document provides detailed instructions for each of the twelve positions, their associated breathing, awareness points, mantras, benefits, and contraindications, and explains how to perform a full round with variations. It notes that Surya Namaskara enhances awareness, physical health, and overall well-being. Precautions for all poses generally include avoiding practice with specific injuries, high blood pressure, pregnancy, or certain chronic conditions.\n\nSummary Highlights:\nYoga Poses Explained:\n*   <b>Vrikshasana (Tree Pose)</b>: Enhances balance, stretches limbs, relieves sciatica, improves focus. Avoid with migraine, insomnia, high/low blood pressure.\n*   <b>Garudasana (Eagle Pose)</b>: Boosts concentration, strengthens muscles, loosens joints. Not for knee, ankle, or shoulder injuries.\n*   <b>Utthita Trikonasana (Extended Triangle Pose)</b>: Strengthens legs, stretches hips, opens chest, improves stability. Avoid with back, neck, hip, shoulder injuries, headaches, or migraines.\n*   <b>Padahastasana (Hands to the Feet Pose)</b>: Prevents abdominal ailments, reduces weight, improves digestion, tones spinal nerves.\n*   <b>Paschimottanasana (Back Stretching Pose)</b>: Stretches hamstrings, increases hip flexibility, tones abdominal organs, beneficial for various disorders. Avoid with slipped disc or sciatica.\n*   <b>Bhujangasana (Cobra Pose)</b>: Deepens breath, removes backache, keeps spine flexible, tones internal organs. Avoid with peptic ulcers, hernia, or during pregnancy.\n*   <b>Dhanurasana (Bow Pose)</b>: Tones heart and lungs, improves posture, beneficial for lower back pain. Avoid with heart problems, high blood pressure, hernia, or abdominal ulcers.\n*   <b>Halasana (Plough Pose)</b>: Massages internal organs, strengthens abdominal muscles, tones spinal nerves, regulates thyroid. Avoid with hernia, slipped disc, high blood pressure, or neck arthritis.\n*   <b>Sarvangasana (Shoulder Stand)</b>: Stimulates thyroid, preserves youth, cures constipation, aids overall health. Avoid with abnormal blood pressure, glaucoma, detached retina, or neck/shoulder injuries.\n*   <b>Sirshasana (Headstand Pose)</b>: Revitalizes brain and body, relieves anxiety, rectifies nervous/glandular disorders. Avoid with high blood pressure, heart disease, severe eye conditions, or during pregnancy/menstruation.\n\nMeditation Asanas:\n*   <b>Purpose</b>: Facilitate long, steady, comfortable sitting for deep meditation, maintaining alertness and a straight spine.\n*   <b>Specific poses</b>: Sukhasana, Ardha Padmasana, Padmasana, Siddhasana, Siddha Yoni Asana, Swastikasana. Each offers varying levels of comfort and benefits for physical and mental balance, energy direction, and nervous system regulation.\n\nSurya Namaskara (Salutations to the Sun):\n*   <b>Comprehensive Practice</b>: A dynamic sequence of twelve asanas combining physical movements with breath, mantra, and meditation.\n*   <b>Benefits</b>: Stimulates and balances all body systems, improves mental clarity, increases awareness, and promotes overall health.\n*   <b>Contraindications</b>: Avoid during fever, acute inflammation, high blood pressure, heart disease, stroke, hernia, intestinal tuberculosis, or certain stages of menstruation and pregnancy.",
        "date": "2025-12-09",
        "category": "Operations",
        "vector_id": "DOC_001"
    },
    "DOC_002": {
        "filename": "Internal_Mission_Debrief.pdf",
        "text": "Power Rangers Operations — Mission Debrief:\nOperation Thunderstrike\nMission Summary\nOperation Thunderstrike was conducted to intercept and disable a hostile energy conduit believed to\npower a large-scale weapon. The team deployed via stealth zords at 2200 hours.\n\fOperational Challenges\nUnexpected resistance encountered from autonomous sentries. Environmental hazards included\nunstable terrain and electromagnetic interference affecting comms.\n\fOutcome & Notes\nWeapon conduit successfully neutralized. Rangers sustained minor injuries. Further reconnaissance\nneeded to determine if additional conduits exist.\n",
        "summary": "Operation Thunderstrike was conducted to intercept and disable a hostile energy conduit believed to power a large-scale weapon. The team deployed via stealth zords and encountered unexpected resistance from autonomous sentries. Additional operational challenges included unstable terrain and electromagnetic interference that affected communications. Despite these issues, the weapon conduit was successfully neutralized. The Rangers sustained minor injuries during the operation, and further reconnaissance is required to determine the existence of any additional conduits.\n\nMission Overview:\n-   <b>Operation Name</b>: Thunderstrike\n-   <b>Primary Objective</b>: Neutralize hostile energy conduit powering a weapon\n-   <b>Challenges Faced</b>: Autonomous sentry resistance, unstable terrain, comms interference\n-   <b>Result</b>: Conduit neutralized, Rangers sustained minor injuries\n-   <b>Next Steps</b>: Further reconnaissance for additional conduits",
        "date": "2025-12-09",
        "category": "Operations",
        "vector_id": "DOC_002"
    },
    "DOC_003": {
        "filename": "yellow_ranger_dummy_document.pdf",
        "text": "POWER RANGERS HEADQUARTERS\nINTERNAL DOCUMENT — LEVEL 2 ACCESS\nDocument Title: FIELD OPERATIONS BRIEF — YELLOW RANGER\nDocument ID: PRHQ-OPS-0427-YR\nDate: 07/12/2025\nPrepared By: Operations Division\nSUMMARY:\nThis document provides updated operational directives for the Yellow Ranger regarding\npatrol responsibilities, communication protocols, and current field awareness.\n1. PATROL PRIORITIES:\n- Maintain surveillance over Sector 4B (East Ridge District).\n- Report unusual Morphin Grid fluctuations immediately.\n- Avoid direct engagement unless threat level exceeds Delta-Class.\n2. EQUIPMENT STATUS:\n- Yellow Ranger's Morpher: Fully operational.\n- Sidearm: Energy output within acceptable range.\n- Auxiliary Gear: Updated nano-armor plates installed.\n3. ACTIVE THREAT INTELLIGENCE:\n- Minor Puttie activity detected near the outskirts.\n- No confirmed sightings of high-level enemy commanders.\n- Recommend heightened awareness during solo patrols.\n4. TEAM COORDINATION:\n- Maintain open communication with Red and Blue Rangers during peak patrol hours.\n- Participate in scheduled training simulation at 1800 hours.\n\f5. NOTES:\nThis is a routine operations document. No immediate high-risk alerts issued.\nEND OF DOCUMENT\n",
        "summary": "This internal document from Power Rangers Headquarters provides updated operational directives for the <b>Yellow Ranger</b>. It outlines patrol responsibilities, communication protocols, and current field awareness. The <b>Yellow Ranger</b> is directed to maintain surveillance in Sector 4B, report Morphin Grid fluctuations, and avoid direct engagement unless facing a <b>Delta-Class</b> threat. All equipment, including the Morpher, sidearm, and auxiliary nano-armor, is fully operational. Minor Puttie activity has been detected, but no high-level enemy commanders have been sighted, prompting a recommendation for heightened awareness during solo patrols. The <b>Yellow Ranger</b> must maintain open communication with the <b>Red Ranger</b> and <b>Blue Ranger</b> during peak patrol hours and participate in a scheduled training simulation. This is a routine operations document with no immediate high-risk alerts issued.\n\nKey Directives\n- Patrol Sector 4B (East Ridge District)\n- Report unusual Morphin Grid fluctuations immediately\n- Avoid direct engagement unless threat level exceeds Delta-Class\n- Maintain open communication with Red and Blue Rangers during peak patrol hours\n- Participate in scheduled training simulation at 1800 hours\n\nEquipment Status\n- Yellow Ranger's Morpher is fully operational\n- Sidearm energy output is within acceptable range\n- Auxiliary Gear has updated nano-armor plates installed\n\nThreat Assessment\n- Minor Puttie activity detected near outskirts\n- No confirmed sightings of high-level enemy commanders\n- Heightened awareness recommended during solo patrols",
        "date": "2025-12-09",
        "category": "Operations",
        "vector_id": "DOC_003"
    },
    "DOC_004": {
        "filename": "yellow_ranger_dummy_document.pdf",
        "text": "POWER RANGERS HEADQUARTERS\nINTERNAL DOCUMENT — LEVEL 2 ACCESS\nDocument Title: FIELD OPERATIONS BRIEF — YELLOW RANGER\nDocument ID: PRHQ-OPS-0427-YR\nDate: 07/12/2025\nPrepared By: Operations Division\nSUMMARY:\nThis document provides updated operational directives for the Yellow Ranger regarding\npatrol responsibilities, communication protocols, and current field awareness.\n1. PATROL PRIORITIES:\n- Maintain surveillance over Sector 4B (East Ridge District).\n- Report unusual Morphin Grid fluctuations immediately.\n- Avoid direct engagement unless threat level exceeds Delta-Class.\n2. EQUIPMENT STATUS:\n- Yellow Ranger's Morpher: Fully operational.\n- Sidearm: Energy output within acceptable range.\n- Auxiliary Gear: Updated nano-armor plates installed.\n3. ACTIVE THREAT INTELLIGENCE:\n- Minor Puttie activity detected near the outskirts.\n- No confirmed sightings of high-level enemy commanders.\n- Recommend heightened awareness during solo patrols.\n4. TEAM COORDINATION:\n- Maintain open communication with Red and Blue Rangers during peak patrol hours.\n- Participate in scheduled training simulation at 1800 hours.\n\f5. NOTES:\nThis is a routine operations document. No immediate high-risk alerts issued.\nEND OF DOCUMENT\n",
        "summary": "This internal document outlines updated operational directives for the <b>Yellow Ranger</b>, focusing on patrol responsibilities, communication protocols, and current field awareness. The Yellow Ranger is tasked with maintaining surveillance over Sector 4B (East Ridge District), reporting unusual Morphin Grid fluctuations immediately, and avoiding direct engagement unless the threat level exceeds Delta-Class. All equipment, including the Morpher, sidearm, and updated nano-armor plates, is fully operational. Current intelligence indicates minor Puttie activity with no confirmed sightings of high-level enemy commanders, prompting a recommendation for heightened awareness during solo patrols. Team coordination requires open communication with the Red and Blue Rangers during peak patrol hours and participation in a scheduled training simulation. This is a routine operations document, and no immediate high-risk alerts have been issued.\n\nKey Directives:\n-   Maintain surveillance over Sector 4B and report Morphin Grid fluctuations immediately.\n-   Avoid direct engagement unless threat level exceeds Delta-Class.\n-   Maintain open communication with Red and Blue Rangers and participate in scheduled training.\n\nEquipment Status:\n-   Yellow Ranger's Morpher is fully operational, sidearm output is acceptable, and auxiliary gear has updated nano-armor.\n\nThreat Assessment:\n-   Minor Puttie activity detected; no high-level enemy commanders confirmed.\n-   Heightened awareness is recommended during solo patrols.",
        "date": "2025-12-07",
        "category": "Operations",
        "vector_id": "DOC_004"
    },
    "DOC_005": {
        "filename": "Avishkar Schedule.pdf",
        "text": " \n \nDate \nCategory Name \nEvent Name \nRound \nVenue \nTime Start \nTime End \n7th December  \nAerodynamix \nHoverTrouble \n- \nSkating Rink \n02:00 PM\n06:00 PM\nMid Evaluation \n- \nMP Hall \n11:00 AM\n03:00 PM\nCyberquest \nError 404 \nR1+R2 \nGS-3 \n10:30 AM\n12:30 PM\nCSS Battle \nR1 \nOnline \n09:00 PM\n11:00 PM\nDebugging Olympics \nR1 \nNLHC 2  \n02:00 PM\n03:30 PM\nSoftathlon \nFinal \nGS-3 \n08:00 AM\n10:00 AM\nTech Maiden \nFinal \nGS-4 \n08:00 AM\n10:00 AM\nFinal Destination \nR1 \nNLHC 2  \n04:00 PM\n05:30 PM\nElectromania \nQuintathlon \nFinal \nFE-16,17 \n10:00 AM\n04:00 PM\nEncode Wars \n- \nGS-6 \n11:00 AM\n02:00 PM\nGenesis  \nCentral Dogma \nR2+R3 \nFN-1 \n03:00 PM\n05:00 PM\nCase and Climb \nR1 \nFN-1 \n05:00 PM\n06:00 PM\nGnosiomania \nGeneral Quiz \n- \nNLHC 1  \n09:00 AM\n01:00 PM\nIndia Quiz \n- \nNLHC 1  \n02:00 PM\n05:00 PM\nMechrocosm \nGame of Codes \nAll \nGS-5 \n10:00 AM\n04:00 PM\nCrack the Case \nR2  \nFN-4 \n02:00 PM\n03:00 PM\nTriathlon (Consultancy) \nR2 \nFN-3 \n10:00 AM\n03:00 PM\nIndustrial Monopoly \nR2  \nNLHC 2  \n10:00 AM\n01:00 PM\nMonopoly \nChanakya Neeti\nR1 \nSMS LH2 \n09:00 AM\n10:30 AM\nNetritva\nR1 \nSMS LH1, BD Lab \n11:00 AM\n01:00 PM\nStall Mart\nR2 \nArena \n05:00 PM\n09:00 PM\nNirmaan \nCognizance \nR1 \nOnline \nTBD \nConstrengtho  \nR3 \nStructural Lab \n02:00 PM\n05:00 PM\nCodigo \nCoding Round \nOnline \nTBD \nCaseFlow \nR1 \nGS-6 \n03:00 PM\n05:00 PM\nOligopoly \nTrading Strategist\nR1 \nSMS LH3 \n10:00 AM\n11:00 AM\nSolo Lobo\nR1 \nSimuln. & BD Lab \n02:00 PM\n04:00 PM\nPitchers\nR1 \nSMS LH1 \n02:00 PM\n04:00 PM\nPowersurge \nPentathlon \nR2 \nGS-7 \n11:00 AM\n01:00 PM\nRoyal Rumble \nR1 \nGS-7 \n02:00 PM\n04:00 PM\nCircuit Bizz \nR1 \nGS-8 \n11:00 AM\n01:00 PM\nFinal Destination \nR1 \nNLHC-2 \n04:00 PM\n05:30 PM\n\f \n \nRasayans \nChemathlon\nR3 \nGS-8 \n09:00 AM\n11:00 AM\nSimulenz 2.0\nR2 \nGS-4 \n12:00 PM\n01:00 PM\nQuizzeria\nR1 \nGS-4 \n02:00 PM\n03:00 PM\nCaseFlow\nR1 \nGS-6 \n03:00 PM\n05:00 PM\nRobomania \nMid Evaluation \n- \nMP Hall \n09:00 AM\n02:00 PM\n8th December \nAerodynamix \nFalcon \n- \nAthletic Ground \n09:00 AM\n05:00 PM\nAeronexus \n- \nAthletic Ground \n09:00 AM\n05:00 PM\nVision Quest \n- \nGS-3 \n11:00 AM\n03:00 PM\nCyberquest \nDry Run Marathon \nR1 \nOnline \n07:30 AM\n09:00 AM\nMathrush \nR1 \nNLHC 2  \n01:00 PM\n02:30 PM\nFinal Destination \nR2 \nGS-4 \n09:30 AM\n11:30 AM\nCode Clash\nR1 (online) \nOnline \n09:30 PM\n11:30 PM\nCSS Battle \nFinal \nGS-5 \n03:30 PM\n05:00 PM\nTux Wars \nFinal \nGS-4 \n12:00 PM\n01:00 PM\nElectromania \nQuintathlon \nInterview \nFE-16,17 \n10:00 AM\n04:00 PM\nCodotron \nFinal \nGS-7 \n02:00 PM\n05:00 PM\nMarket Pulse \n- \nSEW-8 \n03:00 PM\n05:00 PM\nKaggle Sprint \nFinal \nGS-6 \n02:00 PM\n06:00 PM\nEncode Wars \n- \nGS-6 \n11:00 AM\n02:00 PM\nGenesis  \nDashboarding (Consultancy) \nR2+R3 \nFE-18 \n04:00 PM\n06:00 PM\nIQ Odyssey \nR2+R3 \nFE-18 \n10:00 AM\n12:00 PM\nGnosiomania \nMELA Quiz \n- \nNLHC-1 \n09:00 AM\n01:00 PM\nBizTech Quiz \n- \nNLHC-1 \n02:00 PM\n05:00 PM\nMechrocosm \nIndustrial Monopoly \nR3 \nNLHC-2 \n03:00 PM\n06:00 PM\nDeSim \nR2 \nFN-1 \n11:00 AM\n01:00 PM\nTriathlon (Software) \nR2 \nFN-3,4 \n09:00 AM\n01:00 PM\nCrack the Case \nR3 \nGS-4 \n02:00 PM\n04:00 PM\nTurbo Speed \n- \nAthletic Ground \nTBD \nMonopoly \nChanakya Neeti\nR2 \nSMS LH2 \n09:00 AM\n10:30 AM\nReel Fiesta\nR2 \nSMS LH2 \n11:30 AM\n01:00 PM\nNavachar\nR2 \nSMS LH3 \n11:30 AM\n01:00 PM\nStall Mart\nR2 \nArena \n05:00 PM\n09:00 PM\nNetritva\nR2 \nSMS LH1 + BD Lab \n11:00 AM\n01:00 PM\n\f \n \nNirmaan \nCognizance \nR2 (GD) \nSEW-7 \n09:00 AM\n04:00 PM\nLinkidge \nR2 \nFN-3 \n02:00 PM\n05:00 PM\nCaseFlow \nFinal \nGS-8 \n03:00 PM\n05:00 PM\nCodigo \nFinal \nGW-4,5 \n09:00 AM\n12:00 PM\nSamadhan \nFinal \nGW-6 \n09:00 AM\n01:00 PM\nOligopoly \nAd Hole\nR1+R2 \nSMS LH1 \n09:00 AM\n11:00 AM\nSolo Lobo\nR2 \nSMS LH1 \n02:00 PM\n04:00 PM\nTrading Strategists\nR2 \nOnline \n09:00 AM\n04:00 PM\nPowersurge \nPentathlon \nFinal \nGS-7 \n09:00 AM\n12:00 PM\nCircuit Bizz \nR2+R3 \nFEW-15 \n11:00 AM\n05:00 PM\nRoyal Rumble \nR2 \nFE-18 \n01:30 PM\n03:30 PM\nCode Sparks \nR2 \nGS-3 \n03:00 PM\n05:00 PM\nRasayans \nChem Expo\nR2+R3 \nNLHC Gallery \n09:00 AM\n11:00 AM\nChemathlon\nFinal \nGW-10,11 \n11:00 AM\n01:00 PM\nQuizzeria\nR2 \nGW-10,11 \n02:00 PM\n03:00 PM\nCaseFlow\nFinal \nGS-8 \n03:00 PM\n05:00 PM\nRobomania \nGesture Rally \nFinal \nMP Hall \n09:00 AM\n04:00 PM\nTrailblitz\nFinal \nMP Hall \n09:00 AM\n04:00 PM\n9th December \nAerodynamix \nAeronexus\n- \nAthletic Ground \n09:00 AM\n04:00 PM\nFalcon \n- \nAthletic Ground \n09:00 AM\n04:00 PM\nCyberquest \nDebugging Olympics\nFinal \nGS-3 \n04:00 PM\n05:30 PM\nCode Clash \nFinal \nGS-3 \n11:00 AM\n03:30 PM\nRagquest \nFinal \nGS-4 \n02:00 PM\n04:00 PM\nFinal Destination \nFinal \nGS-4 \n10:00 AM\n12:30 PM\nMathrush \nFinal \nGS-4 \n08:00 AM\n09:30 AM\nElectromania \nInnodev \nFinal \nGS-5 \n10:00 AM\n04:00 PM\nRTL Rush \nFinal \nGS-6 \n02:00 PM\n05:00 PM\nKaggle Sprint \nFinal \nFE-16 \n10:00 AM\n04:00 PM\nEncode Wars \nFinal \nGS-6 \n11:00 AM\n02:00 PM\nGenesis  \nDashboarding (Software) \nFinal \nFE-18 \n09:00 AM\nTBD\nCase and Climb \nFinal \nFN-4 \n02:00 PM\n04:00 PM\nGnosiomania\nSports Quiz \n- \nNLHC-1 \n09:00 AM\n01:00 PM\nMechrocosm\nMechathon \nFinal \nGS-7 \n10:00 AM\n03:00 PM\n\f \n \nTriathlon (Core) \nFinal \nFN-1 \n09:00 AM\n01:00 PM\nMonopoly \nChanakya Neeti\nFinal \nSMS LH2 \n09:00 AM\n10:30 AM\nReel Fiesta\nFinal \nBD Lab \n03:30 PM\n05:00 PM\nNavachar\nFinal \nSMS LH3 \n11:30 AM\n01:00 PM\nStall Mart\nFinal \nArena \n05:00 PM\n09:00 PM\nNetritva\nFinal \nSMS LH1  \n11:00 AM\n01:00 PM\nNirmaan \nCognizance \nFinal \nFN-3 \n09:00 AM\n04:00 PM\nLinkidge \nFinal \nNLHC-1 \n01:30 PM\n05:00 PM\nZiggurare \nFinal \nFN-4 \n09:00 AM\n12:00 PM\nConstrengtho  \nFinal \nStructural Lab \n02:00 PM\n04:00 PM\nOligopoly \nAd Hole\nFinal \nBD Lab \n09:00 AM\n11:00 AM\nSolo Lobo\nFinal \nSMS LH2 \n02:00 PM\n04:00 PM\nPitchers\nFinal \nSMS LH1 \n02:00 PM\n04:00 PM\nPowersurge \nDev or die \nFinal \nFE-17 \n10:00 AM\n01:00 PM\nPredefined Hardware \nFinal \nGS-3 \n09:00 AM\n11:00 AM\nFinal Destination \nFinal \nGS-4 \n10:00 AM\n12:30 PM\nRasayans \nData Vision\nFinal \nGS-6 \n09:00 AM\n11:00 AM\nCode Kinetics\nFinal \nGS-8 \n11:00 AM\n01:00 PM\nQuizzeria\nFinal \nGW-10 \n02:00 PM\n03:00 PM\nRobomania \nSketch-O-Bot \nFinal \nMP Hall \n09:00 AM\n04:00 PM\nBot Warrior\nFinal \nMP Hall \n09:00 AM\n04:00 PM\n \n",
        "summary": "The provided document details a comprehensive schedule of events spanning three days from December 7th to December 9th. It encompasses a wide range of activities categorized under various domains including Aerodynamix, Cyberquest, Electromania, Genesis, Gnosiomania, Mechrocosm, Monopoly, Nirmaan, Oligopoly, Powersurge, Rasayans, and Robomania. The schedule outlines specific event names, their respective rounds which vary from initial rounds to mid-evaluations, interviews, and final stages. Events are designated to numerous venues such as skating rinks, MP halls, various general and specialized labs, lecture halls, athletic grounds, and online platforms. Each entry precisely indicates the start and end times for the events. The activities range from technical challenges like coding, debugging, robotics, and electronics to business simulations, case studies, and general knowledge quizzes, reflecting a diverse competitive program over the three-day period.\n\nEvent Schedule Overview:\n- <b>Event Dates</b>: The schedule covers three consecutive days from December 7th to December 9th.\n- <b>Diverse Categories</b>: Events are organized under at least 12 distinct categories, encompassing technical, business, and general knowledge domains.\n- <b>Progressive Rounds</b>: Many events feature multiple rounds (e.g., R1, R2, R3) culminating in final stages, while some are standalone or involve mid-evaluations or interviews.\n- <b>Variety of Venues</b>: Activities are distributed across numerous physical locations such as lecture halls, general purpose labs, specialized labs, outdoor spaces, and online platforms.\n- <b>Comprehensive Details</b>: Each event entry provides a specific event name, category, round, venue, and precise start and end times, detailing a full program for each day.",
        "date": "2025-12-07",
        "category": "Logistics",
        "vector_id": "DOC_005"
    },
    "DOC_006": {
        "filename": "Avishkar Schedule.pdf",
        "text": " \n \nDate \nCategory Name \nEvent Name \nRound \nVenue \nTime Start \nTime End \n7th December  \nAerodynamix \nHoverTrouble \n- \nSkating Rink \n02:00 PM\n06:00 PM\nMid Evaluation \n- \nMP Hall \n11:00 AM\n03:00 PM\nCyberquest \nError 404 \nR1+R2 \nGS-3 \n10:30 AM\n12:30 PM\nCSS Battle \nR1 \nOnline \n09:00 PM\n11:00 PM\nDebugging Olympics \nR1 \nNLHC 2  \n02:00 PM\n03:30 PM\nSoftathlon \nFinal \nGS-3 \n08:00 AM\n10:00 AM\nTech Maiden \nFinal \nGS-4 \n08:00 AM\n10:00 AM\nFinal Destination \nR1 \nNLHC 2  \n04:00 PM\n05:30 PM\nElectromania \nQuintathlon \nFinal \nFE-16,17 \n10:00 AM\n04:00 PM\nEncode Wars \n- \nGS-6 \n11:00 AM\n02:00 PM\nGenesis  \nCentral Dogma \nR2+R3 \nFN-1 \n03:00 PM\n05:00 PM\nCase and Climb \nR1 \nFN-1 \n05:00 PM\n06:00 PM\nGnosiomania \nGeneral Quiz \n- \nNLHC 1  \n09:00 AM\n01:00 PM\nIndia Quiz \n- \nNLHC 1  \n02:00 PM\n05:00 PM\nMechrocosm \nGame of Codes \nAll \nGS-5 \n10:00 AM\n04:00 PM\nCrack the Case \nR2  \nFN-4 \n02:00 PM\n03:00 PM\nTriathlon (Consultancy) \nR2 \nFN-3 \n10:00 AM\n03:00 PM\nIndustrial Monopoly \nR2  \nNLHC 2  \n10:00 AM\n01:00 PM\nMonopoly \nChanakya Neeti\nR1 \nSMS LH2 \n09:00 AM\n10:30 AM\nNetritva\nR1 \nSMS LH1, BD Lab \n11:00 AM\n01:00 PM\nStall Mart\nR2 \nArena \n05:00 PM\n09:00 PM\nNirmaan \nCognizance \nR1 \nOnline \nTBD \nConstrengtho  \nR3 \nStructural Lab \n02:00 PM\n05:00 PM\nCodigo \nCoding Round \nOnline \nTBD \nCaseFlow \nR1 \nGS-6 \n03:00 PM\n05:00 PM\nOligopoly \nTrading Strategist\nR1 \nSMS LH3 \n10:00 AM\n11:00 AM\nSolo Lobo\nR1 \nSimuln. & BD Lab \n02:00 PM\n04:00 PM\nPitchers\nR1 \nSMS LH1 \n02:00 PM\n04:00 PM\nPowersurge \nPentathlon \nR2 \nGS-7 \n11:00 AM\n01:00 PM\nRoyal Rumble \nR1 \nGS-7 \n02:00 PM\n04:00 PM\nCircuit Bizz \nR1 \nGS-8 \n11:00 AM\n01:00 PM\nFinal Destination \nR1 \nNLHC-2 \n04:00 PM\n05:30 PM\n\f \n \nRasayans \nChemathlon\nR3 \nGS-8 \n09:00 AM\n11:00 AM\nSimulenz 2.0\nR2 \nGS-4 \n12:00 PM\n01:00 PM\nQuizzeria\nR1 \nGS-4 \n02:00 PM\n03:00 PM\nCaseFlow\nR1 \nGS-6 \n03:00 PM\n05:00 PM\nRobomania \nMid Evaluation \n- \nMP Hall \n09:00 AM\n02:00 PM\n8th December \nAerodynamix \nFalcon \n- \nAthletic Ground \n09:00 AM\n05:00 PM\nAeronexus \n- \nAthletic Ground \n09:00 AM\n05:00 PM\nVision Quest \n- \nGS-3 \n11:00 AM\n03:00 PM\nCyberquest \nDry Run Marathon \nR1 \nOnline \n07:30 AM\n09:00 AM\nMathrush \nR1 \nNLHC 2  \n01:00 PM\n02:30 PM\nFinal Destination \nR2 \nGS-4 \n09:30 AM\n11:30 AM\nCode Clash\nR1 (online) \nOnline \n09:30 PM\n11:30 PM\nCSS Battle \nFinal \nGS-5 \n03:30 PM\n05:00 PM\nTux Wars \nFinal \nGS-4 \n12:00 PM\n01:00 PM\nElectromania \nQuintathlon \nInterview \nFE-16,17 \n10:00 AM\n04:00 PM\nCodotron \nFinal \nGS-7 \n02:00 PM\n05:00 PM\nMarket Pulse \n- \nSEW-8 \n03:00 PM\n05:00 PM\nKaggle Sprint \nFinal \nGS-6 \n02:00 PM\n06:00 PM\nEncode Wars \n- \nGS-6 \n11:00 AM\n02:00 PM\nGenesis  \nDashboarding (Consultancy) \nR2+R3 \nFE-18 \n04:00 PM\n06:00 PM\nIQ Odyssey \nR2+R3 \nFE-18 \n10:00 AM\n12:00 PM\nGnosiomania \nMELA Quiz \n- \nNLHC-1 \n09:00 AM\n01:00 PM\nBizTech Quiz \n- \nNLHC-1 \n02:00 PM\n05:00 PM\nMechrocosm \nIndustrial Monopoly \nR3 \nNLHC-2 \n03:00 PM\n06:00 PM\nDeSim \nR2 \nFN-1 \n11:00 AM\n01:00 PM\nTriathlon (Software) \nR2 \nFN-3,4 \n09:00 AM\n01:00 PM\nCrack the Case \nR3 \nGS-4 \n02:00 PM\n04:00 PM\nTurbo Speed \n- \nAthletic Ground \nTBD \nMonopoly \nChanakya Neeti\nR2 \nSMS LH2 \n09:00 AM\n10:30 AM\nReel Fiesta\nR2 \nSMS LH2 \n11:30 AM\n01:00 PM\nNavachar\nR2 \nSMS LH3 \n11:30 AM\n01:00 PM\nStall Mart\nR2 \nArena \n05:00 PM\n09:00 PM\nNetritva\nR2 \nSMS LH1 + BD Lab \n11:00 AM\n01:00 PM\n\f \n \nNirmaan \nCognizance \nR2 (GD) \nSEW-7 \n09:00 AM\n04:00 PM\nLinkidge \nR2 \nFN-3 \n02:00 PM\n05:00 PM\nCaseFlow \nFinal \nGS-8 \n03:00 PM\n05:00 PM\nCodigo \nFinal \nGW-4,5 \n09:00 AM\n12:00 PM\nSamadhan \nFinal \nGW-6 \n09:00 AM\n01:00 PM\nOligopoly \nAd Hole\nR1+R2 \nSMS LH1 \n09:00 AM\n11:00 AM\nSolo Lobo\nR2 \nSMS LH1 \n02:00 PM\n04:00 PM\nTrading Strategists\nR2 \nOnline \n09:00 AM\n04:00 PM\nPowersurge \nPentathlon \nFinal \nGS-7 \n09:00 AM\n12:00 PM\nCircuit Bizz \nR2+R3 \nFEW-15 \n11:00 AM\n05:00 PM\nRoyal Rumble \nR2 \nFE-18 \n01:30 PM\n03:30 PM\nCode Sparks \nR2 \nGS-3 \n03:00 PM\n05:00 PM\nRasayans \nChem Expo\nR2+R3 \nNLHC Gallery \n09:00 AM\n11:00 AM\nChemathlon\nFinal \nGW-10,11 \n11:00 AM\n01:00 PM\nQuizzeria\nR2 \nGW-10,11 \n02:00 PM\n03:00 PM\nCaseFlow\nFinal \nGS-8 \n03:00 PM\n05:00 PM\nRobomania \nGesture Rally \nFinal \nMP Hall \n09:00 AM\n04:00 PM\nTrailblitz\nFinal \nMP Hall \n09:00 AM\n04:00 PM\n9th December \nAerodynamix \nAeronexus\n- \nAthletic Ground \n09:00 AM\n04:00 PM\nFalcon \n- \nAthletic Ground \n09:00 AM\n04:00 PM\nCyberquest \nDebugging Olympics\nFinal \nGS-3 \n04:00 PM\n05:30 PM\nCode Clash \nFinal \nGS-3 \n11:00 AM\n03:30 PM\nRagquest \nFinal \nGS-4 \n02:00 PM\n04:00 PM\nFinal Destination \nFinal \nGS-4 \n10:00 AM\n12:30 PM\nMathrush \nFinal \nGS-4 \n08:00 AM\n09:30 AM\nElectromania \nInnodev \nFinal \nGS-5 \n10:00 AM\n04:00 PM\nRTL Rush \nFinal \nGS-6 \n02:00 PM\n05:00 PM\nKaggle Sprint \nFinal \nFE-16 \n10:00 AM\n04:00 PM\nEncode Wars \nFinal \nGS-6 \n11:00 AM\n02:00 PM\nGenesis  \nDashboarding (Software) \nFinal \nFE-18 \n09:00 AM\nTBD\nCase and Climb \nFinal \nFN-4 \n02:00 PM\n04:00 PM\nGnosiomania\nSports Quiz \n- \nNLHC-1 \n09:00 AM\n01:00 PM\nMechrocosm\nMechathon \nFinal \nGS-7 \n10:00 AM\n03:00 PM\n\f \n \nTriathlon (Core) \nFinal \nFN-1 \n09:00 AM\n01:00 PM\nMonopoly \nChanakya Neeti\nFinal \nSMS LH2 \n09:00 AM\n10:30 AM\nReel Fiesta\nFinal \nBD Lab \n03:30 PM\n05:00 PM\nNavachar\nFinal \nSMS LH3 \n11:30 AM\n01:00 PM\nStall Mart\nFinal \nArena \n05:00 PM\n09:00 PM\nNetritva\nFinal \nSMS LH1  \n11:00 AM\n01:00 PM\nNirmaan \nCognizance \nFinal \nFN-3 \n09:00 AM\n04:00 PM\nLinkidge \nFinal \nNLHC-1 \n01:30 PM\n05:00 PM\nZiggurare \nFinal \nFN-4 \n09:00 AM\n12:00 PM\nConstrengtho  \nFinal \nStructural Lab \n02:00 PM\n04:00 PM\nOligopoly \nAd Hole\nFinal \nBD Lab \n09:00 AM\n11:00 AM\nSolo Lobo\nFinal \nSMS LH2 \n02:00 PM\n04:00 PM\nPitchers\nFinal \nSMS LH1 \n02:00 PM\n04:00 PM\nPowersurge \nDev or die \nFinal \nFE-17 \n10:00 AM\n01:00 PM\nPredefined Hardware \nFinal \nGS-3 \n09:00 AM\n11:00 AM\nFinal Destination \nFinal \nGS-4 \n10:00 AM\n12:30 PM\nRasayans \nData Vision\nFinal \nGS-6 \n09:00 AM\n11:00 AM\nCode Kinetics\nFinal \nGS-8 \n11:00 AM\n01:00 PM\nQuizzeria\nFinal \nGW-10 \n02:00 PM\n03:00 PM\nRobomania \nSketch-O-Bot \nFinal \nMP Hall \n09:00 AM\n04:00 PM\nBot Warrior\nFinal \nMP Hall \n09:00 AM\n04:00 PM\n \n",
        "summary": "The provided document details a comprehensive three-day schedule of various events and competitions spanning December 7th, 8th, and 9th. It outlines activities across numerous categories such as Aerodynamix, Cyberquest, Electromania, Genesis, Gnosiomania, Mechrocosm, Monopoly, Nirmaan, Oligopoly, Powersurge, Rasayans, and Robomania. Each entry specifies the event name, the round (including initial rounds, mid-evaluations, interviews, and many final rounds), the designated venue, and the precise start and end times. The events cover a broad spectrum, from technical challenges, coding, and robotics to quizzes, business simulations, case studies, and physical competitions, utilizing both online platforms and various physical locations.\n\nKey Details:\n- <b>Dates Covered</b>: <b>7th</b>, <b>8th</b>, and <b>9th December</b>.\n- <b>Event Categories</b>: Includes <b>Aerodynamix</b>, <b>Cyberquest</b>, <b>Electromania</b>, <b>Genesis</b>, <b>Gnosiomania</b>, <b>Mechrocosm</b>, <b>Monopoly</b>, <b>Nirmaan</b>, <b>Oligopoly</b>, <b>Powersurge</b>, <b>Rasayans</b>, and <b>Robomania</b>.\n- <b>Event Formats</b>: Comprise initial rounds (R1, R2, R3), mid-evaluations, interviews, and numerous <b>final rounds</b>.\n- <b>Venues</b>: Activities are spread across multiple locations such as <b>Skating Rink</b>, <b>MP Hall</b>, various <b>General Seminar (GS) rooms</b>, <b>National Lecture Hall Complex (NLHC)</b>, <b>online platforms</b>, specific <b>Faculty of Engineering (FE) rooms</b>, <b>FN rooms</b>, <b>SMS Lecture Halls</b>, <b>Arena</b>, and the <b>Athletic Ground</b>.\n- <b>Timings</b>: Events are scheduled from early morning, as early as <b>07:30 AM</b>, to late evening, up to <b>11:30 PM</b>, with some timings noted as <b>TBD</b>.",
        "date": "2025-12-07",
        "category": "Logistics",
        "vector_id": "DOC_006"
    },
    "DOC_007": {
        "filename": "Internal_Mission_Debrief.pdf",
        "text": "Power Rangers Operations — Mission Debrief:\nOperation Thunderstrike\nMission Summary\nOperation Thunderstrike was conducted to intercept and disable a hostile energy conduit believed to\npower a large-scale weapon. The team deployed via stealth zords at 2200 hours.\n\fOperational Challenges\nUnexpected resistance encountered from autonomous sentries. Environmental hazards included\nunstable terrain and electromagnetic interference affecting comms.\n\fOutcome & Notes\nWeapon conduit successfully neutralized. Rangers sustained minor injuries. Further reconnaissance\nneeded to determine if additional conduits exist.\n",
        "summary": "Operation <b>Thunderstrike</b> was conducted to intercept and disable a hostile energy conduit believed to power a large-scale weapon. The team, deploying via stealth zords at 2200 hours, encountered unexpected resistance from autonomous sentries. Additional operational challenges included unstable terrain and electromagnetic interference which affected communications. The weapon conduit was successfully neutralized. The Rangers sustained minor injuries, and further reconnaissance is needed to determine if additional conduits exist.\n\nMission Highlights:\nMission Objective: Intercept and disable a hostile energy conduit powering a large-scale weapon.\nKey Challenges: Autonomous sentries, unstable terrain, electromagnetic interference affecting comms.\nMission Outcome: Weapon conduit <b>successfully neutralized</b>.\nRanger Status: Minor injuries sustained.\nFollow-up Action: Further reconnaissance required for additional conduits.",
        "date": "2025-12-08",
        "category": "Operations",
        "vector_id": "DOC_007"
    },
    "DOC_008": {
        "filename": "ASANA.pdf",
        "text": "VRIKSHASANA (TREE POSE) \nIt replicates the graceful, steady stance of a tree. Unlike most yoga poses, the \ntreepose requires keeping our eyes open in order to maintain body balance. \n \nSTEPS: \n● Stand tall and straight with arms by the side of your body. \n● Bend your right knee and place the right foot high up on your left thigh. The \nsole of thefoot should be placed \nflat and firmly near the foot of the thigh. \n● Make sure that your left leg is straight. Find your balance. \n● Once you are well balanced, take a deep breath in, gracefully raise your arms \nover yourhead from the side, \nand bring your palms together in ' Namaste' mudra. \n● Look straight ahead in front of you, at a distant object. A steady gaze helps \nmaintain asteady balance. \n● With slow exhalation gently bring down your hands from the sides. \n● Release your right leg firmly on mat. \n● Repeat same with other leg. \nBENEFITS : \n● It stretches the legs, back and arms. \n● It brings balance to your body and mind. \n● It relieves sciatica pain \n● It improves focus and concentration. \nCONTRADICTIONS: \n● Avoid this posture if you are suffering from migraine, insomnia. \n● Avoid in High and low blood pressure. \n● Avoid raising your hands overhead in case of High B.P also in case of vertigo. \n\fGARUDASANA (EAGLE POSE) \n \nINSTRUCTIONS: \n Stand in Tadasana. \n Exhale, Squat a little, inhale, lift the right leg up and wrap it around the left. \n Place the right hand in front, take the left hand from below and wraparound the \nright hand, palms closer and touching \neach other. \n Keep your spine straight, gaze at a point. \n Hold the posture for a while with normal breath. \n Release the right leg, relax the hands and stand in Tadasana. \n Repeat on the other side. \nBENEFITS OF GARUDASANA: \n Improves concentration. \n Strengthens muscles and loosens up joints of shoulders, arms and legs. \nCONTRAINDICATION OF GARUDASANA: \n People with knee, ankle and shoulder injury must avoide. \n \nUTTHITA TRIKONASANA (Extended Triangle \nPose) \nIt is a foundation triangle pose that’s performed in different styles of yoga. \n\f \nSTEPS: \n Engage your right thigh muscles and draw your right femur into its socket. \nExtend yourright hand towards \nthe front of the room, keeping your right hip tucked \n Lower your right hand down onto your shin or ankle. And take your palm \nbesides ofyour right foot on the \nmat and hold this pose. \n The left shoulder stacks on top of the right one as you open your chest, \nreaching yourleft fingertips towards \nthe ceiling. \n Turn your head to take your gaze up towards your left fingertips. \n Continue to draw your right thigh muscles upward, deepening the crease in \nyour righthip. \n Soften your right knee slightly to prevent hyperextension. \n Stay for at least for 5 breaths. \n Repeat this pose with the left leg. \nBENEFITS: \n Strengthens the legs and stretches the groin, hamstrings and hips. \n It opens the chest musclesand shoulders. \n It improves balance and stability. \nCONTRADICTIONS: \nAvoid this pose if you have an injury to your back and neck, hips or shoulders. \nYou may wish toavoid it if you have \nheadache or migraine. \nPADAHASTASANA (HANDS TO THE FEET \nPOSE) \n\f \nINSTRUCTIONS: \n• Stand in Tadasana. \n• Inhale and raise your hands up over the head. \n• Exhale and bend forward keeping your hands and back in one line, without \nbending your knees or hunching the back. \n• Try to place the abdomen, chest close to the thigh and knees, placing your \npalms beside the feet. \n• After a few breaths, breathe inhale and rise up, relax hands. \nPaschimottanasana (back stretching pose) \n \nSit on the floor with the legs outstretched, feet together and hands on the knees.This is the \nstarting position. \nRelax the whole body. \nSlowly bend forward from the hips, sliding the hands \ndown the legs. Try to grasp the big toes with the fingers \nand thumbs. If this is impossible, hold the heels, ankles or \nany part of the legs that can be reached comfortably. \nMove slowly without forcing or jerking. \nHold the position for a few seconds. Relax the back and \nleg muscles allowing them to gently stretch. \nKeeping the legs straight and utilising the arm muscles, \nnot the back muscles, begin to bend the elbows and gently \nbring the trunk down towards the legs, maintaining a firm \n\fgrip on the toes, feet or legs. \nTry to touch the knees with the forehead. Do not strain. \nThis is the final position. \nHold the position for as long as is comfortable and relax. \nSlowly return to the starting position. \nThis is one round. \nBreathing: Inhale in the starting position. \nExhale slowly while bending forward. \nInhale in the static position. \nExhale while bringing the trunk further towards the legs \nwith the arms. \nBreathe slowly and deeply in the final position or retain \nthe breath out if holding for a short duration. \nInhale while returning to the starting position. \nDuration: Beginners should perform up to 5 rounds, staying \nin the final position for only a short length of time. Adepts \nmay maintain the final position for up to 5 minutes. \nAwareness: Physical - on the abdomen, relaxation of the back \nmuscles or the slow breathing process. \nSpiritual - on swadhisthana chakra. \nSequence: This asana should precede or follow backward \nbending asanas such as setuasana, chakrasana, bhujangasana \nor matsyasana. \nContra-indications: People who suffer from slipped disc or \nsciatica should not practise paschimottanasana. \nBenefits: This asana stretches the hamstring muscles and \nincreases flexibility in the hip joints. It tones and massages \nthe entire abdominal and pelvic region including the liver, \npancreas, spleen, kidneys and adrenal glands. It removes \nexcess weight in this area and helps alleviate disorders of \nthe uro-genital system. It stimulates circulation to the \nnerves and muscles of the spine. It is used in yoga therapy \nfor the management of prolapse, menstrual disorders, \nsluggish liver, diabetes, colitis, kidney complaints, bronchitis \nand eosinophilia. \nMeditation Asanas (5 meditative pose) \nThe main purpose of the meditation asanas is to allow the \npractitioner to sit for extended periods of time without moving \nthe body and without discomfort. Only when the body has \nbeen steady and still for some time will meditation be \nexperienced. Deep meditation requires the spinal column to \nbe straight and very few asanas can satisfy this condition. \nFurthermore, in high stages of meditation the practitioner \nloses control over the muscles of the body. The meditation \nasana, therefore, needs to hold the body in a steady position \nwithout conscious effort. Why not lie in shavasana, then, for \nmeditation since it satisfies all the requirements? Because in \nshavasana there is a tendency to drift into sleep. It is essential \nto remain awake and alert while going through the various \n\fstages which lead to successful meditation. \nSwami Sivananda of Rishikesh said the following about \nasanas and meditation: \"You must be able to sit in one of the \nmeditation asanas for a full three hours at a stretch without \nthe body shaking. Then only will you gain true asana siddhi, \nmastery over the asana, and be able to practise the higher \nstages of pranayama and dhyana. Without securing a steady \nasana you cannot progress well in meditation. The more \nsteady you are in your asana, the more you will be able to \nconcentrate with a one-pointed mind. If you can be steady in \na posture even for one hour, you will be able to acquire a onepointed \nmind and feel the atmic anandam, infinite peace and \nsoulful bliss inside you.\" \n \nPrecautions: If there is severe discomfort or pain in the \nlegs after sitting for some time in a meditation asana, slowly \nunlock the legs and massage them. When the blood circulation \nhas returned to normal and there is no pain, resume the \nasana. However, be aware that the knee is a very delicate and \nmuch abused joint of the body and be careful not to strain it, \nespecially while moving into or out of these meditation asanas. \nDo not on any account use undue force or strain to sit in a \nmeditation asana. \nRight or left leg: In all the asanas discussed in this chapter, \neither the left or the right leg may be placed uppermost. It is \na matter of personal preference and depends on whichever is \nthe more comfortable. Ideally, the leg position should be \nalternated so that the balance on both sides of the body is \nmaintained. \nPractice note: A useful suggestion to make the following \npostures more comfortable is to place a small cushion under \nthe buttocks. \n \nSUKHASANA \n \nSukhasana (easy pose) \n\fSit with the legs straight in front of the body. \nBend the right leg and place the foot under the left thigh. \nBend the left leg and place the foot under the right thigh. \nPlace the hands on the knees in chin or jnana mudra. \nKeep the head, neck and back upright and straight, but \nwithout strain. Close the eyes. \nRelax the whole body. The arms should be relaxed and \nnot held straight. \nBenefits: Sukhasana is the easiest and most comfortable of the \nmeditation postures. It can be utilised without ill effect by \npersons who are unable to sit in the more difficult meditation \npostures. It facilitates mental and physical balance \nwithout causing strain or pain. \nPractice note: Sukhasana is a relaxing posture which may be \nused after extended periods of sitting in siddhasana or \npadmasana. \nAlthough sukhasana is said to be the simplest meditation \nposture, it is difficult to sustain for long periods of time \nunless the knees are close to the ground or on the ground. \nOtherwise most of the body weight is supported by the \nbuttocks and backache develops. The other meditation \nasanas create a larger and, therefore, steadier area of \nsupport. \nVariation: For those who are extremely stiff, sukhasana may \nbe performed sitting cross-legged with a belt or cloth tied \naround the knees and lower back. \nHold the spine upright. \nConcentrate on the physical balance and equalising the \nweight on the right and left side of the body. A light, \nspacey feeling may be experienced. \nWhile maintaining the posture, place the hands on the \nknees in chin or jnana mudra (see section on mudras). \n \nARDHA PADMASANA \n\f \nArdha Padmasana (half-lotus pose) \nSit with the legs straight in front of the body. \nBend one leg and place the sole of the foot on the inside \nof the opposite thigh. \nBend the other leg and place the foot on top of the opposite \nthigh. \n97 \nWithout straining, try to place the upper heel as near as \npossible to the abdomen. Adjust the position so that it is \ncomfortable. \nPlace the hands on the knees in either chin or jnana \nmudra. \nKeep the back, neck and head upright and straight. \nClose the eyes and relax the whole body. \nContra-indications: Those who suffer from sciatica or sacral \nailments should not perform this asana. \nBenefits: The same as for padmasana but at a reduced level. \nPADMASANA \n\f \nPadmasana (lotus pose) \nSit with the legs straight in front of the body. \nSlowly and carefully bend one leg and place the foot on \ntop of the opposite thigh. \nThe sole should face upward and the heel should be close \nto the pubic bone. \nWhen this feels comfortable, bend the other leg and place \nthe foot on top of the opposite thigh. \nBoth knees should, ideally, touch the ground in the final \nposition. \nThe head and spine should be held upright and the \nshoulders relaxed. \nPlace the hands on the knees in chin or jnana mudra. \nRelax the arms with the elbows slightly bent and check \nthat the shoulders are not raised or hunched. \nClose the eyes and relax the whole body. \nObserve the total posture of the body. Make the necessary \nadjustments by moving forward or backward until balance \nand alignment are experienced. Perfect alignment indicates \nthe correct posture of padmasana. \nContra-indications: Those who suffer from sciatica, sacral \ninfections or weak or injured knees should not perform \nthis asana. This asana should not be attempted until \nflexibility of the knees has been developed through practice \nof the pre-meditation asanas. \nBenefits: Padmasana allows the body to be held completely \nsteady for long periods of time. It holds the trunk and \nhead like a pillar with the legs as the firm foundation. As \nthe body is steadied the mind becomes calm. This steadiness \nand calmness is the first step towards real meditation. \nPadmasana directs the flow of prana from mooladhara \nchakra in the perineum, to sahasrara chakra in the head, \nheightening the experience of meditation. \n\fThis posture applies pressure to the lower spine which has \na relaxing effect on the nervous system. The breath \nbecomes slow, muscular tension is decreased and blood \npressure is reduced. The coccygeal and sacral nerves are \ntoned as the normally large blood flow to the legs is \nredirected to the abdominal region. This activity also \nstimulates the digestive process. \n \nSIDDHASANA \n \nSiddhasana (accomplished pose for men) \nSit with the legs straight in front of the body. \nBend the right leg and place the sole of the foot flat \nagainst the inner left thigh with the heel pressing the \nperineum (the area midway between the genitals and the \nanus), sitting on top of the right heel. \nThis is an important aspect of siddhasana. \nAdjust the body until it is comfortable and the pressure of \nthe heel is firmly applied. \nBend the left leg and place the left ankle directly over the \nright ankle so that the ankle bones are touching and the \nheels are one above the other. \nPress the pubis with the left heel directly above the genitals. \nThe genitals will, therefore, lie between the two heels. \nIf this last position is too difficult, simply place the left \n\fheel as near as possible to the pubis. \nPush the toes and the outer edge of the left foot into the \nspace between the right calf and thigh muscles. If necessary, \nthis space may be enlarged slightly by using the hands or \ntemporarily adjusting the position of the right leg. \n100 \nGrasp the right toes and pull them up into the space \nbetween the left calf and thigh. \nAgain adjust the body so that it is comfortable. \nThe legs should now be locked, with the knees touching \nthe ground and the left heel directly above the right heel. \nMake the spine erect and feel as though the body is fixed \non the floor. Place the hands on the knees in jnana, chin \nor chinmaya mudra. \nClose the eyes and relax the whole body. \nContra-indications: Siddhasana should not be practised by \nthose with sciatica or sacral infections. \nBenefits: Siddhasana directs the energy from the lower psychic \ncentres upward through the spine, stimulating the brain \nand calming the entire nervous system. The position of \nthe lower foot at the perineum presses mooladhara chakra, \nstimulating moola bandha, and the pressure applied to \nthe pubic bone presses the trigger point for swadhisthana, \nautomatically activating vajroli/sahajoli mudra. These two \npsycho-muscular locks redirect sexual nervous impulses \nback up the spinal cord to the brain, establishing control \nover the reproductive hormones which is necessary in \norder to maintain brahmacharya for spiritual purposes. \nProlonged periods in siddhasana result in noticeable \ntingling sensations in the mooladhara region which may \nlast for ten to fifteen minutes. This is caused by a reduction \nin the blood supply to the area and by a rebalancing of the \npranic flow in the lower chakras. \nThis posture redirects blood circulation to the lower spine \nand abdomen, toning the lumbar region of the spine, the \npelvis and the abdominal organs, and balancing the \nreproductive system and the blood pressure. \nPractice note: Siddhasana may be performed with either leg \nuppermost. Many people experience discomfort due to \nthe pressure applied where the ankles cross each other. If \nnecessary, place a folded cloth or piece of sponge between \nthe legs at this point. At first the pressure at the perineum \nmay be uncomfortable to maintain but with practice this \nwill be eased. \nNote: The Sanskrit word siddha means 'power' and 'perfection'. \nThe word siddhi is derived from siddha and refers to a psychic \npower or faculty developed through yogic practices. Siddhis \ninclude clairvoyance and telepathy as well as many other lesser \nknown powers such as the ability to disappear at will. Siddhasana, \nor siddha yoni asana for women, is believed to be the asana that \nhelps develop these powers. \n\fSIDDHA YONI ASANA \n \nSiddha Yoni Asana (accomplished pose for women) \nSit with the legs straight in front of the body. \nBend the right leg and place the sole of the foot flat \nagainst the inner left thigh. \nPlace this heel firmly against or inside the labia majora of \nthe vagina. \nAdjust the body position so that it is comfortable while \nsimultaneously feeling the pressure of the right heel. \nBend the left leg and place the left heel directly on top of \nthe right heel so it presses the clitoris, and wedge the left \ntoes down into the space between the calf and thigh so \nthey touch, or almost touch, the floor. \nGrasp the toes of the right foot and pull them up into the \nspace between the left calf and thigh. \nAgain, adjust the position so that it is comfortable. \nEnsure that the knees are firmly on the ground. \nMake the spine fully erect and straight as though it were \nplanted solidly in the earth. \nPlace the hands on the knees is chin, jnana or chinmaya \nmudra. \nClose the eyes and relax the whole body. \nContra-indications: As for siddhasana. \nBenefits: As for siddhasana. \n\fNote: The Sanskrit word yoni means womb' or 'source'. \n \nSWASTIKASANA \nSwastikasana (auspicious pose) \nSit with the legs straight in front of the body. \nBend the left knee and place the sole of the left foot \nagainst the inside of the right thigh, so there is no contact \nbetween the heel and the perineum. \nBend the right knee and place the right foot in the space \nbetween the left thigh and calf muscle, so there is no \ncontact between the heel and the pubis. \nGrasp the toes of the left foot and pull them up into the \nspace between the right calf and thigh. \nAdjust the position so that it is comfortable. The knees \nshould be firmly on the floor. \nStraighten the spine. \nPlace the hands on the knees in chin, jnana or chinmaya \nmudra. \nVariation: Sit with the legs straight in front of the body. \nBend the left leg, place the sole against the inside of the \nright thigh. \nSimilarly, bend the right leg and place the heel of the \nright foot on the floor in front of the left foot with the sole \nresting against the left shin. The heels will now be one in \nfront of the other. \nThe hands may be placed on the knees in jnana, chin or \nchinmaya mudra, or they may be placed on the lap. \nClose the eyes and relax the whole body. \nContra-indications: Swastikasana should not be performed by \npeople with sciatica or sacral infections. \nBenefits: Swastikasana is a healthy position to sit in especially \nfor those suffering from varicose veins, tired and aching \nmuscles or fluid retention in the legs. \nPractice note: This is the easiest classical meditation asana \nand is a simplified version of siddhasana. \nNote: Here the symbol of the swastika represents the different corners \nof the earth and universe, the spokes, and their meeting point and \ncommon centre of consciousness. This asana may be regarded as \nthe one most favourable for realising the unity of existence. \n \nARDHA MATSYENDRASANA \n\f \nArdha Matsyendrasana (half spinal twist) \nSit with the legs stretched out in front of the body. \nBend the right leg and place the right foot flat on the floor \non the outside of the left knee. \nThe toes of the right foot should face forward. \nBend the left leg and bring the foot around to the right \nbuttock. The outside edge of the foot should be in contact \nwith the floor. \nPass the left arm through the space between the chest and \nthe right knee, and place it against the outside of the right \nleg- \nHold the right foot or ankle with the left hand, so that the \nright knee is close to the left armpit. \nSit up as straight as possible. \nRaise the right arm in front of the body and gaze at the \nfingertips. \nSlowly twist to the right, simultaneously moving the arm, \ntrunk and head. \nUse the left arm as a lever against the right leg to twist the \ntrunk as far as possible without using the back muscles. \nFollow the tips of the fingers of the right hand with the \ngaze and look over the right shoulder. \nDo not strain the back. \nBend the right elbow and place the arm around the back \nof the waist. The back of the right hand should wrap \naround the left side of the waist. \nAlternatively, it can be placed as high as possible between \nthe shoulder blades with the fingers pointing up. This \narm position enforces the straightness of the spine. \nReverse the movements to come out of the posture and \nrepeat on the other side. \nBreathing: Inhale in the forward position. \nExhale while twisting the trunk. \nBreathe deeply and slowly without strain in the final \nposition. \nInhale while returning to the starting position. \nDuration: Practise once on each side, gradually increasing the \nholding time to 1 or 2 minutes on each side of the body or \n\fup to 30 breaths. \nAwareness: Physical - on keeping the spine straight and on \nthe movement of the abdomen created by the breath in \nthe final position. \nSpiritual - on ajna chakra. \nSequence: This asana should be performed after completing a \nseries of forward and backward bending asanas. \nContra-indications: Women more than two or three months \npregnant should avoid this practice. People suffering from \npeptic ulcer, hernia or hyperthyroidism should only practise \nthis pose under expert guidance. \nPeople with sciatica or slipped disc may benefit from this \nasana, but great care should be taken. \nBenefits: This asana simultaneously stretches the muscles on \none side of the back and abdomen while contracting the \nmuscles on the other side. It tones the nerves of the spine, \nmakes the back muscles supple, relieves lumbago and \nmuscular spasms, and reduces the tendency of adjoining \nvertebrae to develop osteophytes. When practised with \ncare, it has proved beneficial for mild cases of slipped disc. \nArdha matsyendrasana massages the abdominal organs, \nalleviating digestive ailments. It regulates the secretion of \nadrenaline and bile and is recommended in the yogic \nmanagement of diabetes. Under special guidance it is \nused for the yogic management of sinusitis, hay fever, \nbronchitis, constipation, colitis, menstrual disorders, \nurinary tract disorders and cervical spondylitis, as long as \nit can be performed without any discomfort. \nVariation: For beginners and those with stiff bodies the following \nadjustments to the position may be made: \nThe leg that is placed by the side of the buttock should \nremain straight and the hand holding the ankle may be \nwrapped around the opposite thigh, hugging the knee to \nthe chest. \nBHUJANGASANA (COBRA POSE) \n \nINSTRUCTIONS: \n Keep the hands and feet in place. \n Slide the chest forward and raise first the head, the shoulders, then, \nstraightening the elbows, arch the back into the \n\fcobra pose. \n This will lower the buttocks and hips to the floor. \n Bend the head back and direct the gaze upward to the eyebrow centre. \n The thighs and hips remain on the floor and the arms support the trunk. \n Unless the spine is very flexible the arms will remain slightly bent. \nBENEFITS OF BHUJANGASANA: \n It deepens the breath. \n It helps in removing backache. \n It keeps the spine flexible and healthy. \n It tones the liver, kidneys, ovaries, and uterus. \nCONTRADICTION OF BHUJANGASANA: \n Avoid if one is suffering from peptic ulcers or Hernia. \n Pregnant woman should avoid this practice. \n \nDHANURASANA (BOW POSE) \n \nINSTRUCTIONS: \n Lie flat on the stomach with the legs and feet together, and the arms and \nhands beside the body. \n Bend the knees and bring the heels close to the buttocks. Grasp the ankles \nwith the hands. \n Keep the knees and thighs firmly on the floor and the arms straight throughout \nthe practice. \n Place the chin on the floor. \n This is the starting position. \n Tense the legs and push the feet backwards while raising the head and chest \nas high as possible from the floor \nwithout straining. \n Use the backward movement of the legs to assist the raising of the body, \nallowing the back muscles to remain \npassive. \n In the final position the head is tilted back. \n Hold the final position for as long as is comfortable. \n Slowly lower the chest and head to the ground by releasing the legs. \n\f Relax in the prone position until the respiration returns to normal. This is one \nround. \nBENEFITS OF DHANURASANA: \nThe same benefits as for Dhanurasana, but at decreased levels. \n It is useful for lower back pain due to slipped disc or cervical spondylitis when it \ncan be performed without discomfort. \n It tones the heart and lungs and is beneficial for respiratory disorders. It helps \nto improve the posture. \nCONTRADICTION OF DHANURASANA: \n People who suffer with heart problems, high blood pressure should avoid it. \n A person suffering from Hernia, peptic ulcers or duodenal ulcers, appendicitis \nand the other abdominal ailments \nshould not do this asana. \n \nHALASANA \n \nHalasana (plough pose) \nLie flat on the back with the legs and feet together. Place \nthe arms beside the body with the palms facing down. \nRelax the whole body. \nRaise both legs to the vertical position, keeping them \nstraight and together, using only the abdominal muscles. \nPress down on the arms and lift the buttocks, rolling the \nback away from the floor. Lower the legs over the head. \nTry to touch the toes to the floor behind the head. \nDo not force the toes to touch the floor. \nTurn the palms up, bend the elbows and place the hands \nbehind the ribcage to support the back as in sarvangasana. \nRelax and hold the final pose for as long as is comfortable. \nReturn to the starting position by lowering the arms with \nthe palms facing down, then slowly lower the back and \nbuttocks to the floor. \n\fRaise the legs to the vertical position. Using the abdominal \nmuscles, lower the legs to the starting position, keeping \nthe knees straight. \nBreathing: Inhale while in the lying position. \nRetain the breath inside while assuming the final pose. \nBreathe slowly and deeply in the final pose. \nRetain the breath inside while returning to the starting \nposition. \nDuration: Beginners should hold the pose for 15 seconds, \ngradually adding a few seconds per week until it can be \nheld for one minute. \nAdepts may hold the final pose up to 10 minutes or longer. \nAwareness: Physical - on the abdomen, relaxation of the back \nmuscles, the respiration or the thyroid gland. \nSpiritual - on manipura or vishuddhi chakra. \nSequence: If possible, perform this asana immediately after \nsarvangasana. To go from sarvangasana to halasana, bring \nthe feet slightly over the head for balance, slowly remove \nthe arms from their position behind the back and place \nthem on the floor in the starting position, palms facing \ndown. Relax the body and slowly lower the legs over the \nhead, keeping them straight and together, until the toes \ntouch the floor. Keep the legs straight and continue as \ndescribed above. \nFollow halasana with either matsyasana, ushtrasana or \nsupta vajrasana as a counterpose, practised for half the \ncombined duration of sarvangasana and halasana. It may \nalso be followed by the variations for halasana given at the \nend of this chapter. Halasana is a good preparatory practice \nfor paschimottanasana. \nContra-indications: This asana should not be practised by those \nwho suffer from hernia, slipped disc, sciatica, high blood \npressure or any serious back problem, especially arthritis \nof the neck. \nBenefits: The movement of the diaphragm which takes place \nduring the practice of halasana massages all the internal \norgans, activates the digestion, relieving constipation and \ndyspepsia, revitalises the spleen and the suprarenal glands, \npromotes the production of insulin by the pancreas and \nimproves liver and kidney function. It strengthens the \nabdominal muscles, relieves spasms in the back muscles, \ntones the spinal nerves, improving the operation of the \nsympathetic nervous system, and increases blood circulation \nto the whole area. It regulates the activities of the \nthyroid gland which balances the body's metabolic rate, \nand stimulates the thymus gland, boosting the immune \nsystem. \nIt is used in yoga therapy for the management of asthma, \nbronchitis, constipation, hepatitis, urinary tract and \nmenstrual disorders. \n \n\fSARVANGASANA (SHOULDER STAND) \n \nSarvangasana, shoulder stand or more fully Salamba Sarvangasana, is an \ninverted pose. The word 'Sarvang' means \nentire body. From the final position of asana, it can be deduced that ithas a \nfavorable effect on entire body. It is \nstrongly recommended to attempt this posture only after a few weeks of initial \ntraining. \nBENEFITS: \n● It stimulates the thyroid and parathyroid glands and normalizes their functions. \n● It preserves the youth by keeping the spine elastic. \n● It cures constipation, indigestion, diabetes, varicose veins and menstrual \ndisorders. \n● It helps in achieving perfect health. \nCONTRADICTIONS: \n Practitioners suffering from abnormal blood pressure, glaucoma, detached \nretina, chronic thyroid disorders, \nand neck or shoulder injuries should avoid this asana. Practice only after \nconsulting the trained yoga \npractitioner. \n \n \nSIRSHASANA \n\f \nSirshasana (headstand pose) \nStage I: Sit in vajrasana. \nClose the eyes and relax the whole body. \nAfter a few minutes, open the eyes, bend forward and \nplace the forearms on a folded blanket with the fingers \ninterlocked and the elbows in front of the knees. \nThe distance between the elbows should be equal to the \ndistance from each elbow to the interlocked fingers, \nforming an equilateral triangle. \nPlace the crown of the head on the blanket between the \ninterlocked fingers. Wrap the hands around the head to \nmake a firm support so that it cannot roll backward when \npressure is applied. \nStage 2: Lift the knees and buttocks off the floor and straighten \nthe legs. \nStage 3: Slowly walk the feet as close as possible towards the \ntrunk and head, gradually moving the back towards the \nvertical position. \nBend the knees slightly, press the thighs against the \nabdomen and lower chest. \nTransfer the body weight slowly from the toes onto the \nhead and arms, maintaining a steady balance. \n\fRaise one foot off the floor about 20 cm, carefully balance, \nthen raise the other foot and balance on the head and \narms. \nStage 4: Bending the knees, gradually raise the calves in a \ncontrolled movement. Adjust the trunk slightly to counterbalance \nthe weight of the legs. \nFold the legs back so the heels move towards the buttocks. \nTo accomplish this movement contract the muscles of the \nlower back. The knees are now pointing down with the \nlegs together. \nMaintain the position for a few seconds, being aware of \ncomplete balance before proceeding. \nStage 5: Raise the knees to the vertical position. Keeping the \nheels near the buttocks, slowly straighten the hips so that \nthe thighs move up and away from the torso. \nRaise the knees until they point directly upward and the \nthighs are in line with the trunk. \nBalance the body. \nStage 6: Slowly straighten the knees and raise the calves. \nThe whole body should be in one straight line with the \nfeet relaxed. \nThis is the final position. \nClose the eyes and balance the whole body, relaxing in the \nfinal position for as long as is comfortable. \nStage 7: Return to the starting position. \nSlowly bend the knees and lower the body with control in \nthe reverse order until the toes touch the floor. Remain \nwith the head on the ground in the kneeling position for \na short time, then slowly return to the upright position. \n \nBreathing: Inhale at the end of stage 1. \nRetain the breath inside while raising the body into the \nfinal position. Beginners may practise normal breathing \nwhile coming into the posture. \nBreathe normally in the final position. The breath should \nbecome increasingly subtle in this posture as one becomes \naccustomed to it. \nDuration: Beginners should start by holding the pose for 30 \nseconds, gradually adding about 1 minute per week until \nthe desired period is reached. 3 to 5 minutes spent in the \nfinal position is sufficient for general health, however, \nsirshasana may be practised by experts for periods of up \nto 30 minutes. \nAwareness: Physical - for beginners, on maintaining balance. \nFor adepts, on the brain, centre of the head or respiration. \nSpiritual - on sahasrara chakra. \nSequence: While beginners should practise sirshasana at the \nend of their asana programme, more experienced practitioners \nmay perform it either at the beginning or the end. \nIt should be followed by tadasana, as a counterpose, and \nthen shavasana. \n\fContra-indications: Sirshasana should not be practised by \npeople with high blood pressure, heart disease, thrombosis, \narteriosclerosis, chronic catarrh, chronic constipation, \nkidney problems, impure blood, severe near-sightedness, \nweak eye blood vessels, conjunctivitis, chronic glaucoma, \ninflammation of the ears or any form of blood haemorrhage \nin the head; neither should it be practised during pregnancy \nor menstruation. Although it is recommended as a \npreventative measure for headache or migraine, it should \nnot be practised during either. \nBenefits: This asana is very powerful for awakening sahasrara \nchakra and, therefore, it is considered the greatest of all \nasanas. \nSirshasana increases the blood flow to the brain and \npituitary gland, revitalising the entire body and mind. It \nrelieves anxiety and other psychological disturbances which \nform the root cause of many disorders. It is, therefore, \nrecommended for the prevention of asthma, hay fever, \ndiabetes and menopausal imbalance. It also helps to rectify \nmany forms of nervous and glandular disorder, especially \nthose related to the reproductive system. \nThis asana reverses the effect of gravity on the spine. \nStrain on the back is thus alleviated and the reversed flow \nof blood in the legs and visceral regions aids tissue \nregeneration. The weight of the abdominal organs on the \ndiaphragm encourages deep exhalation so that larger \namounts of carbon dioxide, toxins and bacteria are \nremoved from the lungs. \nPractice note: In the final position, most of the weight of the \nbody is sustained by the top of the head, the arms being \nused to maintain balance only. Beginners, however, may \nuse the arms as support until the neck is strong enough to \nbear the full weight of the body, and a reasonable sense of \nbalance has been developed. \nIf the practitioner should fall during the practice, the \nbody should be as relaxed as possible. If the fall is forward, \ntry to fold the knees into the chest so that the impact on \nthe floor is sustained by the feet. If falling backwards, arch \nthe back, again so that the feet sustain the impact. \n \n \nSurya Namaskara \n\f \n \nSALUTATIONS TO THE SUN \nThe Sanskrit name surya here refers to the sun and namaskara \nmeans 'salutations'. Surya namaskara has been handed down \nfrom the enlightened sages of the Vedic Age. The sun symbolises \nspiritual consciousness and, in ancient times, was \nworshipped on a daily basis. In yoga the sun is represented by \npingala or surya nadi, the pranic channel which carries the \nvital, life-giving force. \nThis dynamic group of asanas is not regarded as being a \ntraditional part of hatha yoga practices as it was added to the \noriginal asana group at a later time. However, it is an effective \nway of loosening up, stretching, massaging and toning all the \njoints, muscles and internal organs of the body. Its versatility \nand application make it one of the most useful methods of \ninducing a healthy, vigorous and active life while, at the same \ntime, preparing for spiritual awakening and the resulting expansion \nof awareness. \nSurya namaskara is a complete sadhana, spiritual practice, \nin itself for it includes asana, pranayama, mantra and \nmeditation techniques. It is an excellent group of asanas with \nwhich to start morning practice. Surya namaskara has a direct \nvitalising effect on the solar energy of the body which flows \nthrough pingala nadi. Regular practice of surya namaskara \nregulates pingala nadi, whether it is under-active or overactive. \nRegulation of pingala nadi leads to a balanced energy \nsystem at both mental and physical levels. \nSurya namaskara is composed of three elements: form, \n\fenergy and rhythm. The twelve asanas are the physical matrix \naround which the form of the practice is woven. These asanas \ngenerate prana, the subtle energy which activates the psychic \nbody. Their performance, in a steady, rhythmic sequence, \nreflects the rhythms of the universe; the twenty-four hours of \nthe day, the twelve zodiac phases of the year and the biorhythms \nof the body. The application of this form and rhythm to the \nbody/mind complex generates the transforming force which \nproduces a fuller and more dynamic life. \nTime of practice: The ideal time to practise surya namaskara \nis at sunrise, the most peaceful time of day. Whenever possible, \npractise in the open air, facing the rising sun. Sunset is also a \ngood time to practise as it stimulates the digestive fire. Surya \nnamaskara, however, may be practised at any time provided \nthe stomach is empty. \nPreparation: Before commencing the practice, stand with \nthe feet together or slightly apart, and the arms hanging \nloosely by the side of the body. Close the eyes gently and \nbecome aware of the whole physical body as one homogeneous \nunit. In this position the body may sway from side to side \nor backward and forward. Try to minimise this oscillation and \nbalance the body weight equally on both feet. \nBring the awareness inside the body and mentally begin to \nrelax it. Starting from the top of the head, take the awareness \nsystematically through all the parts, releasing any tension. \nIntensify, once more, the awareness of the whole physical \nbody and feel in harmony with it. \nTake the awareness to the soles of the feet in contact with \nthe floor. Feel that the whole body is being pulled downwards \nby gravity and that any tensions are being pulled down, \nthrough the body and into the ground. At the same time, \nexperience the vital force surging up from the earth and \nflooding the whole being. \nFinally, take the awareness to the eyebrow centre and visualise \na brilliant, red rising sun infusing the whole body and \nmind with its vitalising and healing rays. Imagine you are \nfacing the early morning sunrise, about to practise surya \nnamaskara with smooth synchronised movements, flowing into \none another like a dance. \nPosition 1: Pranamasana (prayer pose) \nThis is the final position and is the same as position 1. \nBring the palms together in front of the chest. \nBreathing: Exhale while assuming the final position. \nAwareness: Physical - on the region of the heart. \nSpiritual - on anahata chakra. \nMantra: Om Mitraye Namaha. \nHASTA UTTHANASANA \nPosition 2: Hasta Utthanasana (raised arms pose) \nRaise and stretch both arms above the head. \nKeep the arms separated, shoulder width apart. \nBend the head, arms and upper trunk backward. \n\fBreathing: Inhale while raising the arms. \nAwareness: Physical - on the stretch of the abdomen and \nexpansion of the lungs. \nSpiritual - on vishuddhi chakra. \nMantra: Om Ravaye Namaha, salutations to the shining one. \nBenefits: This pose stretches all the abdominal organs and \nimproves digestion. It exercises the arm and shoulder \nmuscles, tones the spinal nerves, opens the lungs and \nremoves excess weight. \n \nPADAHASTASANA \nPosition 3: Padahastasana (hand to foot pose) \nBend forward until the fingers or palms of the hands \ntouch the floor on either side of the feet. \nTry to touch the knees with the forehead. \nDo not strain. \nKeep the knees straight. \nBreathing: Exhale while bending forward. \nTry to contract the abdomen in the final position to expel \nthe maximum amount of air from the lungs. \nAwareness: Physical - on the pelvic region. \nSpiritual - on swadhisthana chakra. \nMantra: Om Suryaya Namaha, salutations to he who induces \nactivity. \nContra-indications: People with back conditions should not \nbend forward fully. Bend from the hips, keeping the spine \nstraight, until the back forms a ninety degree angle with \nthe legs, or bend only as far as comfortable. \nBenefits: This pose is useful in eliminating or preventing \nstomach or abdominal ailments. It reduces excess weight \nin the abdominal region, improves digestion and helps to \nremove constipation. It improves blood circulation, makes \nthe spine supple and tones the spinal nerves. \n \nASHWA SANCHALANASANA \nPosition 4: Ashwa Sanchalanasana (equestrian pose) \nPlace the palms of the hands flat on the floor beside the \nfeet. \nStretch the right leg back as far as possible. \nAt the same time, bend the left knee, keeping the left foot \non the floor in the same position. Keep the arms straight. \nIn the final position, the weight of the body should be \nsupported on both hands, the left foot, right knee and \ntoes of the right foot. The head should be tilted backward, \nthe back arched and the inner gaze directed upward to \nthe eyebrow centre. \nBreathing: Inhale while stretching the right leg back. \nAwareness: Physical - on the stretch from the thigh to the \nchest or on the eyebrow centre. \nSpiritual - on ajna chakra. \nMantra: Om Bhanave Namaha, salutations to he who illumines. \n\fBenefits: This pose massages the abdominal organs and improves \ntheir functioning, strengthens the leg muscles and \ninduces balance in the nervous system. \nPractice note: In the final pose the palms of the hands should \nbe flat on the floor initially. Later on, more advanced \npractitioners may come up onto the fingertips. \nPARVATASANA \nPosition 5: Parvatasana (mountain pose) \nTake the left foot back beside the right foot. \nSimultaneously, raise the buttocks and lower the head \nbetween the arms, so that the back and legs form two sides \nof a triangle. \nThe legs and arms should be straight in the final position. \nTry to keep the heels on the floor in the final pose and \nbring the head towards the knees. \nDo not strain. \nBreathing: Exhale while taking the left leg back. \nAwareness: Physical - on relaxing the hips or on the throat \nregion. \nSpiritual - on vishuddhi chakra. \nMantra: Om Khagaya Namaha, salutations to he who moves \nquickly in the sky. \nBenefits: This pose strengthens the nerves and muscles in the \narms and legs. The spinal nerves are toned and circulation \nis stimulated especially in the upper spine, between the \nshoulder blades. \nASHTANGA NAMASKARA \nPosition 6: Ashtanga Namaskara (salute with eight parts or \npoints) \nLower the knees, chest and chin to the floor. \nIn the final position only the toes, knees, chest, hands and \nchin touch the floor. The knees, chest and chin should \ntouch the floor simultaneously. If this is not possible, first \nlower the knees, then the chest, and finally the chin. \nThe buttocks, hips and abdomen should be raised. \nBreathing: The breath is held outside in this pose. There is no \nrespiration. \nAwareness: Physical - on the abdominal region. \nSpiritual - on manipura chakra. \nMantra: Om Pushne Namaha, salutations to the giver of strength. \nBenefits: This pose strengthens the leg and arm muscles, \ndevelops the chest and exercises the region of the spine \nbetween the shoulder blades. \nBHUJANGASANA \nPosition 7: Bhujangasana (cobra pose) \nLower the buttocks and hips to the floor, \nStraightening the elbows, arch the back and push the \nchest forward into the cobra pose. \nBend the head back and direct the gaze upward to the \neyebrow centre. \nThe thighs and hips remain on the floor and the arms \n\fsupport the trunk. \nUnless the spine is very flexible the arms will remain \nslightly bent. \nBreathing: Inhale while raising the torso and arching the back. \nAwareness: Physical - on relaxation of the spine. \nSpiritual - on swadhisthana chakra. \nMantra: Om Hiranya Garbhaya Namaha, salutations to the golden, \ncosmic self. \nBenefits: This pose keeps the spine supple, improving circulation \nin the back region and toning the spinal nerves. It \ntones the reproductive organs, stimulates digestion and \nrelieves constipation. It also tones the liver and massages \nthe kidneys and adrenal glands. \nPosition 8: Parvatasana (mountain pose) \nThis stage is a repeat of position 5. \nFrom bhujangasana assume parvatasana. \nThe hands and feet do not move from position 7. \nRaise the buttocks and lower the heels to the floor. \nBreathing: Exhale while raising the buttocks. \nAwareness: Physical - on relaxing the hips or on the throat \nregion. \nSpiritual - on vishuddhi chakra. \nMantra: Om Marichaye Namaha, salutations to the Lord of the \nDawn. \nPosition 9: Ashwa Sanchalanasana (equestrian pose) \nThis stage is the same as position 4. \nKeep the palms flat on the floor. \nBend the left leg and bring the left foot forward between \nthe hands. \nSimultaneously, lower the right knee so that it touches the \nfloor and push the pelvis forward. \nTilt the head backward, arch the back and gaze at the \neyebrow centre. \nBreathing: Inhale while assuming the pose. \nAwareness: Physical - on the stretch from the thigh to the \nchest, or on the eyebrow centre. \nSpiritual - on ajna chakra. \nMantra: Om Adityaya Namaha, salutations to the son of Aditi, \nthe cosmic Mother. \nPosition 10: Padahastasana (hand to foot pose) \nThis position is a repeat of position 3. \nBring the right foot forward next to the left foot. \nStraighten both knees. \nBring the forehead as close to the knees as possible without \nstraining. \nBreathing: Exhale while performing the movement. \nAwareness: Physical - on the pelvic region. \nSpiritual - on swadhisthana chakra. \nMantra: Om Savitre Namaha, salutations to Lord of Creation. \nPosition 11: Hasta Utthanasana (raised arms pose) \nThis stage is a repeat of position 2. \n\fRaise the torso and stretch the arms above the head. \nKeep the arms separated, shoulder width apart. \nBend the head, arms and upper trunk backward. \nBreathing: Inhale while straightening the body. \nAwareness: Physical - on the stretch of the abdomen and \nexpansion of the lungs. \nSpiritual - on vishuddhi chakra. \nMantra: Om Arkaya Namaha, salutations to he who is fit to be \npraised. \nPosition 12: Pranamasana (prayer pose) \nThis is the final position and is the same as position 1. \nBring the palms together in front of the chest. \nBreathing: Exhale while assuming the final position. \nAwareness: Physical - on the region of the heart. \nSpiritual - on anahata chakra. \nMantra: Om Bhaskaraya Namaha, salutations to he who leads to \nenlightenment. \nPositions 13-24: The twelve positions of surya namaskara are \npractised twice to complete one round. Positions 1 to 12 \nconstitute half a round. In the second half, the positions \nare repeated with two small changes: \na) In position 16, instead of stretching the right foot \nbackward, stretch the left foot back. \nb) In position 21, bend the right leg and bring the right \nfoot between the hands. \nConclusion: On the completion of each half round, lower \nthe arms to the side, relax the body and concentrate on \nthe breath until it returns to normal. After completing \nsurya namaskara, practise shavasana for a few minutes. \nThis will allow the heartbeat and respiration to return to \nnormal and all the muscles to relax. \nPractice note: In reference to position 4: when practising surya \nnamaskara for general or therapeutic purposes, begin by \nplacing the right leg back to activate pingala nadi as \ndescribed above; if practising for mental concentradon \nor for a more meditadonal effect, begin with the left leg \nwhich will activate ida nadi. \nBeeja mantras: As an alternative to the twelve names of the \nsun, there is a series of beeja mantras or seed syllables. \nBeeja mantras do not have any literal meaning but set up \npowerful vibrations of energy within the mind and body. \nThe beeja mantras are six in number and are repeated \nconsecutively in the following order, four times during a \ncomplete round of surya namaskara: \n1. Om Hraam 4. Om Hraim \n2. Om Hreem 5. Om Hraum \n3. Om Hroom 6. Om Hrah \nWhen surya namaskara is practised too fast to repeat the \nsun mantras, the beeja mantras may be used. \nDuration: For spiritual benefits, practise 3 to 12 rounds slowly. \nFor physical benefits, practise 3 to 12 rounds more quickly. \n\fBeginners should start with 2 or 3 rounds and add one \nmore round every few weeks to avoid fatigue. Advanced \nstudents may practise a larger number of rounds, however, \nstrain should be avoided at all times. In special cases, a \ndaily practice of 108 rounds may be undertaken for \npurification, but only under expert guidance. \nSequence: Surya namaskara is ideally practised before other \nasanas. \nContra-indications: The practice of surya namaskara should \nbe immediately discontinued if a fever, acute inflammation, \nboils or rashes occur. These may develop due to excess \ntoxins in the body. When the toxins have been eliminated, \nthe practice may be resumed. \nSurya namaskara should not be practised by people \nsuffering from high blood pressure, coronary artery \ndiseases, or by those who have had a stroke, as it may over \nstimulate or damage a weak heart or blood vessel system. \nIt should also be avoided in cases of hernia or intestinal \ntuberculosis. \nPeople with back conditions should consult a medical \nexpert before commencing this practice. Although some \nback conditions may be alleviated by this practice, \nconditions such as slipped disc and sciatica will be better \nmanaged through an alternative asana programme. \nDuring the onset of menstruation, this practice should be \navoided. If there are no adverse effects, the practice may \nbe resumed after the initial flow or towards the end of the \nperiod. During pregnancy it may be practised with care \nuntil the beginning of the twelfth week. Following childbirth, \nit may be commenced approximately forty days \nafter delivery for re-toning the uterine muscles. \nGeneral benefits: The practice of surya namaskara as a whole \ngives a great number of benefits. \nIt stimulates and balances all the systems of the body, \nincluding the endocrine, circulatory, respiratory and \ndigestive systems. Its influence on the pineal gland and \nthe hypothalamus helps to prevent pineal degeneration \nand calcification. This balances the transition period \nbetween childhood and adolescence in growing children. \nSynchronising the breath with the physical movements of \nsurya namaskara ensures that the practitioner, at least for \na few minutes daily, breathes as deeply and rhythmically \nas possible. This removes carbon dioxide from the lungs \nand replaces it with fresh oxygen, increasing mental clarity \nby bringing fresh, oxygenated blood to the brain. \nTo conclude, surya namaskara is the ideal practice to \nincrease awareness and bestow good health and wellbeing. \nNote: For more information on this practice see the Bihar School of \nYoga publication Surya Namaskara: A Technique of Solar \nRevitalization. \n \n",
        "summary": "The provided document describes various yoga asanas, detailing their instructions, benefits, and contradictions. These poses aim to improve physical and mental wellbeing, flexibility, strength, and focus, while also aiding in spiritual development and meditation.\n\nVrikshasana, or Tree Pose, promotes balance and stretches the legs, back, and arms, and helps relieve sciatica. It requires open eyes for stability and should be avoided by individuals with migraine, insomnia, high or low blood pressure, or vertigo. Garudasana, the Eagle Pose, enhances concentration, strengthens muscles, and loosens joints, but is unsuitable for those with knee, ankle, or shoulder injuries. Utthita Trikonasana, the Extended Triangle Pose, strengthens legs, stretches hips, and improves balance, with contradictions for back, neck, hip, or shoulder injuries, headaches, or migraines. Padahastasana, or Hands to the Feet Pose, involves bending forward to touch the feet, beneficial for abdominal health and spinal flexibility.\n\nPaschimottanasana, the Back Stretching Pose, involves sitting and bending forward to grasp the feet. This pose stretches hamstrings, increases hip flexibility, tones abdominal and pelvic organs, and is used for various therapeutic purposes, though contraindicated for slipped disc or sciatica.\n\nThe document then introduces Meditation Asanas, emphasizing their role in allowing practitioners to sit comfortably and steadily for extended periods to achieve deep meditation. Key precautions include avoiding knee strain and the recommendation to use a cushion for comfort. Sukhasana, the Easy Pose, is the most comfortable for meditation, promoting mental and physical balance. Ardha Padmasana, the Half-Lotus Pose, and Padmasana, the Lotus Pose, are more advanced meditative postures that steady the body and calm the mind, directing vital energy. They are contraindicated for sciatica, sacral infections, or weak knees. Siddhasana, the Accomplished Pose for men, and Siddha Yoni Asana for women, are powerful for stimulating energy centers, calming the nervous system, and balancing reproductive hormones. Swastikasana, the Auspicious Pose, is a simpler meditation pose beneficial for conditions like varicose veins and fluid retention in the legs.\n\nArdha Matsyendrasana, the Half Spinal Twist, involves twisting the trunk to tone spinal nerves and massage abdominal organs, benefiting digestion and circulation, but pregnant women beyond two to three months, and those with peptic ulcers or hernia should exercise caution or avoid it. Bhujangasana, the Cobra Pose, deepens breath and keeps the spine flexible, toning internal organs, though contraindicated for peptic ulcers, hernia, or pregnancy. Dhanurasana, the Bow Pose, strengthens the back, tones heart and lungs, and improves posture, but is avoided by individuals with heart problems, high blood pressure, or abdominal ailments. Halasana, the Plough Pose, massages internal organs, activates digestion, and strengthens abdominal muscles, while regulating the thyroid gland and boosting the immune system. It should be avoided by those with hernia, slipped disc, or high blood pressure. Sarvangasana, the Shoulder Stand, is an inverted pose that stimulates thyroid glands, preserves spine elasticity, and addresses various health issues, but is contraindicated for abnormal blood pressure, glaucoma, or neck injuries. Sirshasana, the Headstand Pose, is considered powerful for awakening higher consciousness, increasing blood flow to the brain, and alleviating psychological disturbances, but has extensive contraindications including high blood pressure, heart disease, and pregnancy.\n\nFinally, Surya Namaskara, or Salutations to the Sun, is a dynamic sequence of twelve asanas that functions as a complete spiritual practice. It loosens, stretches, massages, and tones the entire body, balancing energy systems and preparing for spiritual awakening. Ideally practiced at sunrise, it offers numerous benefits including stimulating and balancing all body systems, improving respiratory function, and increasing mental clarity. Contraindications include fever, high blood pressure, coronary artery diseases, hernia, and certain stages of menstruation or pregnancy.\n\n<b>Yoga Poses and Benefits</b>\n  Vrikshasana (Tree Pose) improves <b>balance</b>, stretches limbs, and relieves sciatica.\n  Garudasana (Eagle Pose) strengthens muscles, loosens joints, and boosts <b>concentration</b>.\n  Utthita Trikonasana (Extended Triangle Pose) fortifies legs, stretches hips, and enhances <b>stability</b>.\n  Padahastasana (Hands to the Feet Pose) benefits abdominal health and spinal <b>flexibility</b>.\n  Paschimottanasana (Back Stretching Pose) increases hip flexibility and tones abdominal organs, aiding <b>digestion</b>.\n  Meditation Asanas (Sukhasana, Ardha Padmasana, Padmasana, Siddhasana, Siddha Yoni Asana, Swastikasana) provide a steady posture for meditation, calm the mind, and direct <b>prana</b>.\n  Ardha Matsyendrasana (Half Spinal Twist) tones spinal nerves, massages abdominal organs, and improves <b>circulation</b>.\n  Bhujangasana (Cobra Pose) enhances breath, keeps the spine <b>flexible</b>, and tones internal organs.\n  Dhanurasana (Bow Pose) strengthens the back, tones the heart and lungs, and improves <b>posture</b>.\n  Halasana (Plough Pose) activates digestion, strengthens abdominal muscles, and regulates the <b>thyroid</b>.\n  Sarvangasana (Shoulder Stand) stimulates thyroid function and keeps the spine <b>elastic</b>.\n  Sirshasana (Headstand Pose) increases blood flow to the brain, revitalizes the body, and awakens higher <b>consciousness</b>.\n  Surya Namaskara (Salutations to the Sun) is a dynamic sequence that balances all body systems and increases overall <b>wellbeing</b>.\n\n<b>General Contraindications</b>\n  Individuals with high or low blood pressure, heart problems, severe injuries (knees, ankles, shoulders, back, neck), migraine, insomnia, glaucoma, or detached retina should avoid certain poses.\n  Pregnant women or those with specific abdominal ailments (hernia, ulcers) should also avoid or modify particular asanas, especially inverted poses or deep twists.\n  Practitioners are advised to consult experts, especially for chronic conditions or during menstruation and pregnancy, and to avoid strain.",
        "date": "2025-12-08",
        "category": "Operations",
        "vector_id": "DOC_008"
    },
    "DOC_009": {
        "filename": "ASANA.pdf",
        "text": "VRIKSHASANA (TREE POSE) \nIt replicates the graceful, steady stance of a tree. Unlike most yoga poses, the \ntreepose requires keeping our eyes open in order to maintain body balance. \n \nSTEPS: \n● Stand tall and straight with arms by the side of your body. \n● Bend your right knee and place the right foot high up on your left thigh. The \nsole of thefoot should be placed \nflat and firmly near the foot of the thigh. \n● Make sure that your left leg is straight. Find your balance. \n● Once you are well balanced, take a deep breath in, gracefully raise your arms \nover yourhead from the side, \nand bring your palms together in ' Namaste' mudra. \n● Look straight ahead in front of you, at a distant object. A steady gaze helps \nmaintain asteady balance. \n● With slow exhalation gently bring down your hands from the sides. \n● Release your right leg firmly on mat. \n● Repeat same with other leg. \nBENEFITS : \n● It stretches the legs, back and arms. \n● It brings balance to your body and mind. \n● It relieves sciatica pain \n● It improves focus and concentration. \nCONTRADICTIONS: \n● Avoid this posture if you are suffering from migraine, insomnia. \n● Avoid in High and low blood pressure. \n● Avoid raising your hands overhead in case of High B.P also in case of vertigo. \n\fGARUDASANA (EAGLE POSE) \n \nINSTRUCTIONS: \n Stand in Tadasana. \n Exhale, Squat a little, inhale, lift the right leg up and wrap it around the left. \n Place the right hand in front, take the left hand from below and wraparound the \nright hand, palms closer and touching \neach other. \n Keep your spine straight, gaze at a point. \n Hold the posture for a while with normal breath. \n Release the right leg, relax the hands and stand in Tadasana. \n Repeat on the other side. \nBENEFITS OF GARUDASANA: \n Improves concentration. \n Strengthens muscles and loosens up joints of shoulders, arms and legs. \nCONTRAINDICATION OF GARUDASANA: \n People with knee, ankle and shoulder injury must avoide. \n \nUTTHITA TRIKONASANA (Extended Triangle \nPose) \nIt is a foundation triangle pose that’s performed in different styles of yoga. \n\f \nSTEPS: \n Engage your right thigh muscles and draw your right femur into its socket. \nExtend yourright hand towards \nthe front of the room, keeping your right hip tucked \n Lower your right hand down onto your shin or ankle. And take your palm \nbesides ofyour right foot on the \nmat and hold this pose. \n The left shoulder stacks on top of the right one as you open your chest, \nreaching yourleft fingertips towards \nthe ceiling. \n Turn your head to take your gaze up towards your left fingertips. \n Continue to draw your right thigh muscles upward, deepening the crease in \nyour righthip. \n Soften your right knee slightly to prevent hyperextension. \n Stay for at least for 5 breaths. \n Repeat this pose with the left leg. \nBENEFITS: \n Strengthens the legs and stretches the groin, hamstrings and hips. \n It opens the chest musclesand shoulders. \n It improves balance and stability. \nCONTRADICTIONS: \nAvoid this pose if you have an injury to your back and neck, hips or shoulders. \nYou may wish toavoid it if you have \nheadache or migraine. \nPADAHASTASANA (HANDS TO THE FEET \nPOSE) \n\f \nINSTRUCTIONS: \n• Stand in Tadasana. \n• Inhale and raise your hands up over the head. \n• Exhale and bend forward keeping your hands and back in one line, without \nbending your knees or hunching the back. \n• Try to place the abdomen, chest close to the thigh and knees, placing your \npalms beside the feet. \n• After a few breaths, breathe inhale and rise up, relax hands. \nPaschimottanasana (back stretching pose) \n \nSit on the floor with the legs outstretched, feet together and hands on the knees.This is the \nstarting position. \nRelax the whole body. \nSlowly bend forward from the hips, sliding the hands \ndown the legs. Try to grasp the big toes with the fingers \nand thumbs. If this is impossible, hold the heels, ankles or \nany part of the legs that can be reached comfortably. \nMove slowly without forcing or jerking. \nHold the position for a few seconds. Relax the back and \nleg muscles allowing them to gently stretch. \nKeeping the legs straight and utilising the arm muscles, \nnot the back muscles, begin to bend the elbows and gently \nbring the trunk down towards the legs, maintaining a firm \n\fgrip on the toes, feet or legs. \nTry to touch the knees with the forehead. Do not strain. \nThis is the final position. \nHold the position for as long as is comfortable and relax. \nSlowly return to the starting position. \nThis is one round. \nBreathing: Inhale in the starting position. \nExhale slowly while bending forward. \nInhale in the static position. \nExhale while bringing the trunk further towards the legs \nwith the arms. \nBreathe slowly and deeply in the final position or retain \nthe breath out if holding for a short duration. \nInhale while returning to the starting position. \nDuration: Beginners should perform up to 5 rounds, staying \nin the final position for only a short length of time. Adepts \nmay maintain the final position for up to 5 minutes. \nAwareness: Physical - on the abdomen, relaxation of the back \nmuscles or the slow breathing process. \nSpiritual - on swadhisthana chakra. \nSequence: This asana should precede or follow backward \nbending asanas such as setuasana, chakrasana, bhujangasana \nor matsyasana. \nContra-indications: People who suffer from slipped disc or \nsciatica should not practise paschimottanasana. \nBenefits: This asana stretches the hamstring muscles and \nincreases flexibility in the hip joints. It tones and massages \nthe entire abdominal and pelvic region including the liver, \npancreas, spleen, kidneys and adrenal glands. It removes \nexcess weight in this area and helps alleviate disorders of \nthe uro-genital system. It stimulates circulation to the \nnerves and muscles of the spine. It is used in yoga therapy \nfor the management of prolapse, menstrual disorders, \nsluggish liver, diabetes, colitis, kidney complaints, bronchitis \nand eosinophilia. \nMeditation Asanas (5 meditative pose) \nThe main purpose of the meditation asanas is to allow the \npractitioner to sit for extended periods of time without moving \nthe body and without discomfort. Only when the body has \nbeen steady and still for some time will meditation be \nexperienced. Deep meditation requires the spinal column to \nbe straight and very few asanas can satisfy this condition. \nFurthermore, in high stages of meditation the practitioner \nloses control over the muscles of the body. The meditation \nasana, therefore, needs to hold the body in a steady position \nwithout conscious effort. Why not lie in shavasana, then, for \nmeditation since it satisfies all the requirements? Because in \nshavasana there is a tendency to drift into sleep. It is essential \nto remain awake and alert while going through the various \n\fstages which lead to successful meditation. \nSwami Sivananda of Rishikesh said the following about \nasanas and meditation: \"You must be able to sit in one of the \nmeditation asanas for a full three hours at a stretch without \nthe body shaking. Then only will you gain true asana siddhi, \nmastery over the asana, and be able to practise the higher \nstages of pranayama and dhyana. Without securing a steady \nasana you cannot progress well in meditation. The more \nsteady you are in your asana, the more you will be able to \nconcentrate with a one-pointed mind. If you can be steady in \na posture even for one hour, you will be able to acquire a onepointed \nmind and feel the atmic anandam, infinite peace and \nsoulful bliss inside you.\" \n \nPrecautions: If there is severe discomfort or pain in the \nlegs after sitting for some time in a meditation asana, slowly \nunlock the legs and massage them. When the blood circulation \nhas returned to normal and there is no pain, resume the \nasana. However, be aware that the knee is a very delicate and \nmuch abused joint of the body and be careful not to strain it, \nespecially while moving into or out of these meditation asanas. \nDo not on any account use undue force or strain to sit in a \nmeditation asana. \nRight or left leg: In all the asanas discussed in this chapter, \neither the left or the right leg may be placed uppermost. It is \na matter of personal preference and depends on whichever is \nthe more comfortable. Ideally, the leg position should be \nalternated so that the balance on both sides of the body is \nmaintained. \nPractice note: A useful suggestion to make the following \npostures more comfortable is to place a small cushion under \nthe buttocks. \n \nSUKHASANA \n \nSukhasana (easy pose) \n\fSit with the legs straight in front of the body. \nBend the right leg and place the foot under the left thigh. \nBend the left leg and place the foot under the right thigh. \nPlace the hands on the knees in chin or jnana mudra. \nKeep the head, neck and back upright and straight, but \nwithout strain. Close the eyes. \nRelax the whole body. The arms should be relaxed and \nnot held straight. \nBenefits: Sukhasana is the easiest and most comfortable of the \nmeditation postures. It can be utilised without ill effect by \npersons who are unable to sit in the more difficult meditation \npostures. It facilitates mental and physical balance \nwithout causing strain or pain. \nPractice note: Sukhasana is a relaxing posture which may be \nused after extended periods of sitting in siddhasana or \npadmasana. \nAlthough sukhasana is said to be the simplest meditation \nposture, it is difficult to sustain for long periods of time \nunless the knees are close to the ground or on the ground. \nOtherwise most of the body weight is supported by the \nbuttocks and backache develops. The other meditation \nasanas create a larger and, therefore, steadier area of \nsupport. \nVariation: For those who are extremely stiff, sukhasana may \nbe performed sitting cross-legged with a belt or cloth tied \naround the knees and lower back. \nHold the spine upright. \nConcentrate on the physical balance and equalising the \nweight on the right and left side of the body. A light, \nspacey feeling may be experienced. \nWhile maintaining the posture, place the hands on the \nknees in chin or jnana mudra (see section on mudras). \n \nARDHA PADMASANA \n\f \nArdha Padmasana (half-lotus pose) \nSit with the legs straight in front of the body. \nBend one leg and place the sole of the foot on the inside \nof the opposite thigh. \nBend the other leg and place the foot on top of the opposite \nthigh. \n97 \nWithout straining, try to place the upper heel as near as \npossible to the abdomen. Adjust the position so that it is \ncomfortable. \nPlace the hands on the knees in either chin or jnana \nmudra. \nKeep the back, neck and head upright and straight. \nClose the eyes and relax the whole body. \nContra-indications: Those who suffer from sciatica or sacral \nailments should not perform this asana. \nBenefits: The same as for padmasana but at a reduced level. \nPADMASANA \n\f \nPadmasana (lotus pose) \nSit with the legs straight in front of the body. \nSlowly and carefully bend one leg and place the foot on \ntop of the opposite thigh. \nThe sole should face upward and the heel should be close \nto the pubic bone. \nWhen this feels comfortable, bend the other leg and place \nthe foot on top of the opposite thigh. \nBoth knees should, ideally, touch the ground in the final \nposition. \nThe head and spine should be held upright and the \nshoulders relaxed. \nPlace the hands on the knees in chin or jnana mudra. \nRelax the arms with the elbows slightly bent and check \nthat the shoulders are not raised or hunched. \nClose the eyes and relax the whole body. \nObserve the total posture of the body. Make the necessary \nadjustments by moving forward or backward until balance \nand alignment are experienced. Perfect alignment indicates \nthe correct posture of padmasana. \nContra-indications: Those who suffer from sciatica, sacral \ninfections or weak or injured knees should not perform \nthis asana. This asana should not be attempted until \nflexibility of the knees has been developed through practice \nof the pre-meditation asanas. \nBenefits: Padmasana allows the body to be held completely \nsteady for long periods of time. It holds the trunk and \nhead like a pillar with the legs as the firm foundation. As \nthe body is steadied the mind becomes calm. This steadiness \nand calmness is the first step towards real meditation. \nPadmasana directs the flow of prana from mooladhara \nchakra in the perineum, to sahasrara chakra in the head, \nheightening the experience of meditation. \n\fThis posture applies pressure to the lower spine which has \na relaxing effect on the nervous system. The breath \nbecomes slow, muscular tension is decreased and blood \npressure is reduced. The coccygeal and sacral nerves are \ntoned as the normally large blood flow to the legs is \nredirected to the abdominal region. This activity also \nstimulates the digestive process. \n \nSIDDHASANA \n \nSiddhasana (accomplished pose for men) \nSit with the legs straight in front of the body. \nBend the right leg and place the sole of the foot flat \nagainst the inner left thigh with the heel pressing the \nperineum (the area midway between the genitals and the \nanus), sitting on top of the right heel. \nThis is an important aspect of siddhasana. \nAdjust the body until it is comfortable and the pressure of \nthe heel is firmly applied. \nBend the left leg and place the left ankle directly over the \nright ankle so that the ankle bones are touching and the \nheels are one above the other. \nPress the pubis with the left heel directly above the genitals. \nThe genitals will, therefore, lie between the two heels. \nIf this last position is too difficult, simply place the left \n\fheel as near as possible to the pubis. \nPush the toes and the outer edge of the left foot into the \nspace between the right calf and thigh muscles. If necessary, \nthis space may be enlarged slightly by using the hands or \ntemporarily adjusting the position of the right leg. \n100 \nGrasp the right toes and pull them up into the space \nbetween the left calf and thigh. \nAgain adjust the body so that it is comfortable. \nThe legs should now be locked, with the knees touching \nthe ground and the left heel directly above the right heel. \nMake the spine erect and feel as though the body is fixed \non the floor. Place the hands on the knees in jnana, chin \nor chinmaya mudra. \nClose the eyes and relax the whole body. \nContra-indications: Siddhasana should not be practised by \nthose with sciatica or sacral infections. \nBenefits: Siddhasana directs the energy from the lower psychic \ncentres upward through the spine, stimulating the brain \nand calming the entire nervous system. The position of \nthe lower foot at the perineum presses mooladhara chakra, \nstimulating moola bandha, and the pressure applied to \nthe pubic bone presses the trigger point for swadhisthana, \nautomatically activating vajroli/sahajoli mudra. These two \npsycho-muscular locks redirect sexual nervous impulses \nback up the spinal cord to the brain, establishing control \nover the reproductive hormones which is necessary in \norder to maintain brahmacharya for spiritual purposes. \nProlonged periods in siddhasana result in noticeable \ntingling sensations in the mooladhara region which may \nlast for ten to fifteen minutes. This is caused by a reduction \nin the blood supply to the area and by a rebalancing of the \npranic flow in the lower chakras. \nThis posture redirects blood circulation to the lower spine \nand abdomen, toning the lumbar region of the spine, the \npelvis and the abdominal organs, and balancing the \nreproductive system and the blood pressure. \nPractice note: Siddhasana may be performed with either leg \nuppermost. Many people experience discomfort due to \nthe pressure applied where the ankles cross each other. If \nnecessary, place a folded cloth or piece of sponge between \nthe legs at this point. At first the pressure at the perineum \nmay be uncomfortable to maintain but with practice this \nwill be eased. \nNote: The Sanskrit word siddha means 'power' and 'perfection'. \nThe word siddhi is derived from siddha and refers to a psychic \npower or faculty developed through yogic practices. Siddhis \ninclude clairvoyance and telepathy as well as many other lesser \nknown powers such as the ability to disappear at will. Siddhasana, \nor siddha yoni asana for women, is believed to be the asana that \nhelps develop these powers. \n\fSIDDHA YONI ASANA \n \nSiddha Yoni Asana (accomplished pose for women) \nSit with the legs straight in front of the body. \nBend the right leg and place the sole of the foot flat \nagainst the inner left thigh. \nPlace this heel firmly against or inside the labia majora of \nthe vagina. \nAdjust the body position so that it is comfortable while \nsimultaneously feeling the pressure of the right heel. \nBend the left leg and place the left heel directly on top of \nthe right heel so it presses the clitoris, and wedge the left \ntoes down into the space between the calf and thigh so \nthey touch, or almost touch, the floor. \nGrasp the toes of the right foot and pull them up into the \nspace between the left calf and thigh. \nAgain, adjust the position so that it is comfortable. \nEnsure that the knees are firmly on the ground. \nMake the spine fully erect and straight as though it were \nplanted solidly in the earth. \nPlace the hands on the knees is chin, jnana or chinmaya \nmudra. \nClose the eyes and relax the whole body. \nContra-indications: As for siddhasana. \nBenefits: As for siddhasana. \n\fNote: The Sanskrit word yoni means womb' or 'source'. \n \nSWASTIKASANA \nSwastikasana (auspicious pose) \nSit with the legs straight in front of the body. \nBend the left knee and place the sole of the left foot \nagainst the inside of the right thigh, so there is no contact \nbetween the heel and the perineum. \nBend the right knee and place the right foot in the space \nbetween the left thigh and calf muscle, so there is no \ncontact between the heel and the pubis. \nGrasp the toes of the left foot and pull them up into the \nspace between the right calf and thigh. \nAdjust the position so that it is comfortable. The knees \nshould be firmly on the floor. \nStraighten the spine. \nPlace the hands on the knees in chin, jnana or chinmaya \nmudra. \nVariation: Sit with the legs straight in front of the body. \nBend the left leg, place the sole against the inside of the \nright thigh. \nSimilarly, bend the right leg and place the heel of the \nright foot on the floor in front of the left foot with the sole \nresting against the left shin. The heels will now be one in \nfront of the other. \nThe hands may be placed on the knees in jnana, chin or \nchinmaya mudra, or they may be placed on the lap. \nClose the eyes and relax the whole body. \nContra-indications: Swastikasana should not be performed by \npeople with sciatica or sacral infections. \nBenefits: Swastikasana is a healthy position to sit in especially \nfor those suffering from varicose veins, tired and aching \nmuscles or fluid retention in the legs. \nPractice note: This is the easiest classical meditation asana \nand is a simplified version of siddhasana. \nNote: Here the symbol of the swastika represents the different corners \nof the earth and universe, the spokes, and their meeting point and \ncommon centre of consciousness. This asana may be regarded as \nthe one most favourable for realising the unity of existence. \n \nARDHA MATSYENDRASANA \n\f \nArdha Matsyendrasana (half spinal twist) \nSit with the legs stretched out in front of the body. \nBend the right leg and place the right foot flat on the floor \non the outside of the left knee. \nThe toes of the right foot should face forward. \nBend the left leg and bring the foot around to the right \nbuttock. The outside edge of the foot should be in contact \nwith the floor. \nPass the left arm through the space between the chest and \nthe right knee, and place it against the outside of the right \nleg- \nHold the right foot or ankle with the left hand, so that the \nright knee is close to the left armpit. \nSit up as straight as possible. \nRaise the right arm in front of the body and gaze at the \nfingertips. \nSlowly twist to the right, simultaneously moving the arm, \ntrunk and head. \nUse the left arm as a lever against the right leg to twist the \ntrunk as far as possible without using the back muscles. \nFollow the tips of the fingers of the right hand with the \ngaze and look over the right shoulder. \nDo not strain the back. \nBend the right elbow and place the arm around the back \nof the waist. The back of the right hand should wrap \naround the left side of the waist. \nAlternatively, it can be placed as high as possible between \nthe shoulder blades with the fingers pointing up. This \narm position enforces the straightness of the spine. \nReverse the movements to come out of the posture and \nrepeat on the other side. \nBreathing: Inhale in the forward position. \nExhale while twisting the trunk. \nBreathe deeply and slowly without strain in the final \nposition. \nInhale while returning to the starting position. \nDuration: Practise once on each side, gradually increasing the \nholding time to 1 or 2 minutes on each side of the body or \n\fup to 30 breaths. \nAwareness: Physical - on keeping the spine straight and on \nthe movement of the abdomen created by the breath in \nthe final position. \nSpiritual - on ajna chakra. \nSequence: This asana should be performed after completing a \nseries of forward and backward bending asanas. \nContra-indications: Women more than two or three months \npregnant should avoid this practice. People suffering from \npeptic ulcer, hernia or hyperthyroidism should only practise \nthis pose under expert guidance. \nPeople with sciatica or slipped disc may benefit from this \nasana, but great care should be taken. \nBenefits: This asana simultaneously stretches the muscles on \none side of the back and abdomen while contracting the \nmuscles on the other side. It tones the nerves of the spine, \nmakes the back muscles supple, relieves lumbago and \nmuscular spasms, and reduces the tendency of adjoining \nvertebrae to develop osteophytes. When practised with \ncare, it has proved beneficial for mild cases of slipped disc. \nArdha matsyendrasana massages the abdominal organs, \nalleviating digestive ailments. It regulates the secretion of \nadrenaline and bile and is recommended in the yogic \nmanagement of diabetes. Under special guidance it is \nused for the yogic management of sinusitis, hay fever, \nbronchitis, constipation, colitis, menstrual disorders, \nurinary tract disorders and cervical spondylitis, as long as \nit can be performed without any discomfort. \nVariation: For beginners and those with stiff bodies the following \nadjustments to the position may be made: \nThe leg that is placed by the side of the buttock should \nremain straight and the hand holding the ankle may be \nwrapped around the opposite thigh, hugging the knee to \nthe chest. \nBHUJANGASANA (COBRA POSE) \n \nINSTRUCTIONS: \n Keep the hands and feet in place. \n Slide the chest forward and raise first the head, the shoulders, then, \nstraightening the elbows, arch the back into the \n\fcobra pose. \n This will lower the buttocks and hips to the floor. \n Bend the head back and direct the gaze upward to the eyebrow centre. \n The thighs and hips remain on the floor and the arms support the trunk. \n Unless the spine is very flexible the arms will remain slightly bent. \nBENEFITS OF BHUJANGASANA: \n It deepens the breath. \n It helps in removing backache. \n It keeps the spine flexible and healthy. \n It tones the liver, kidneys, ovaries, and uterus. \nCONTRADICTION OF BHUJANGASANA: \n Avoid if one is suffering from peptic ulcers or Hernia. \n Pregnant woman should avoid this practice. \n \nDHANURASANA (BOW POSE) \n \nINSTRUCTIONS: \n Lie flat on the stomach with the legs and feet together, and the arms and \nhands beside the body. \n Bend the knees and bring the heels close to the buttocks. Grasp the ankles \nwith the hands. \n Keep the knees and thighs firmly on the floor and the arms straight throughout \nthe practice. \n Place the chin on the floor. \n This is the starting position. \n Tense the legs and push the feet backwards while raising the head and chest \nas high as possible from the floor \nwithout straining. \n Use the backward movement of the legs to assist the raising of the body, \nallowing the back muscles to remain \npassive. \n In the final position the head is tilted back. \n Hold the final position for as long as is comfortable. \n Slowly lower the chest and head to the ground by releasing the legs. \n\f Relax in the prone position until the respiration returns to normal. This is one \nround. \nBENEFITS OF DHANURASANA: \nThe same benefits as for Dhanurasana, but at decreased levels. \n It is useful for lower back pain due to slipped disc or cervical spondylitis when it \ncan be performed without discomfort. \n It tones the heart and lungs and is beneficial for respiratory disorders. It helps \nto improve the posture. \nCONTRADICTION OF DHANURASANA: \n People who suffer with heart problems, high blood pressure should avoid it. \n A person suffering from Hernia, peptic ulcers or duodenal ulcers, appendicitis \nand the other abdominal ailments \nshould not do this asana. \n \nHALASANA \n \nHalasana (plough pose) \nLie flat on the back with the legs and feet together. Place \nthe arms beside the body with the palms facing down. \nRelax the whole body. \nRaise both legs to the vertical position, keeping them \nstraight and together, using only the abdominal muscles. \nPress down on the arms and lift the buttocks, rolling the \nback away from the floor. Lower the legs over the head. \nTry to touch the toes to the floor behind the head. \nDo not force the toes to touch the floor. \nTurn the palms up, bend the elbows and place the hands \nbehind the ribcage to support the back as in sarvangasana. \nRelax and hold the final pose for as long as is comfortable. \nReturn to the starting position by lowering the arms with \nthe palms facing down, then slowly lower the back and \nbuttocks to the floor. \n\fRaise the legs to the vertical position. Using the abdominal \nmuscles, lower the legs to the starting position, keeping \nthe knees straight. \nBreathing: Inhale while in the lying position. \nRetain the breath inside while assuming the final pose. \nBreathe slowly and deeply in the final pose. \nRetain the breath inside while returning to the starting \nposition. \nDuration: Beginners should hold the pose for 15 seconds, \ngradually adding a few seconds per week until it can be \nheld for one minute. \nAdepts may hold the final pose up to 10 minutes or longer. \nAwareness: Physical - on the abdomen, relaxation of the back \nmuscles, the respiration or the thyroid gland. \nSpiritual - on manipura or vishuddhi chakra. \nSequence: If possible, perform this asana immediately after \nsarvangasana. To go from sarvangasana to halasana, bring \nthe feet slightly over the head for balance, slowly remove \nthe arms from their position behind the back and place \nthem on the floor in the starting position, palms facing \ndown. Relax the body and slowly lower the legs over the \nhead, keeping them straight and together, until the toes \ntouch the floor. Keep the legs straight and continue as \ndescribed above. \nFollow halasana with either matsyasana, ushtrasana or \nsupta vajrasana as a counterpose, practised for half the \ncombined duration of sarvangasana and halasana. It may \nalso be followed by the variations for halasana given at the \nend of this chapter. Halasana is a good preparatory practice \nfor paschimottanasana. \nContra-indications: This asana should not be practised by those \nwho suffer from hernia, slipped disc, sciatica, high blood \npressure or any serious back problem, especially arthritis \nof the neck. \nBenefits: The movement of the diaphragm which takes place \nduring the practice of halasana massages all the internal \norgans, activates the digestion, relieving constipation and \ndyspepsia, revitalises the spleen and the suprarenal glands, \npromotes the production of insulin by the pancreas and \nimproves liver and kidney function. It strengthens the \nabdominal muscles, relieves spasms in the back muscles, \ntones the spinal nerves, improving the operation of the \nsympathetic nervous system, and increases blood circulation \nto the whole area. It regulates the activities of the \nthyroid gland which balances the body's metabolic rate, \nand stimulates the thymus gland, boosting the immune \nsystem. \nIt is used in yoga therapy for the management of asthma, \nbronchitis, constipation, hepatitis, urinary tract and \nmenstrual disorders. \n \n\fSARVANGASANA (SHOULDER STAND) \n \nSarvangasana, shoulder stand or more fully Salamba Sarvangasana, is an \ninverted pose. The word 'Sarvang' means \nentire body. From the final position of asana, it can be deduced that ithas a \nfavorable effect on entire body. It is \nstrongly recommended to attempt this posture only after a few weeks of initial \ntraining. \nBENEFITS: \n● It stimulates the thyroid and parathyroid glands and normalizes their functions. \n● It preserves the youth by keeping the spine elastic. \n● It cures constipation, indigestion, diabetes, varicose veins and menstrual \ndisorders. \n● It helps in achieving perfect health. \nCONTRADICTIONS: \n Practitioners suffering from abnormal blood pressure, glaucoma, detached \nretina, chronic thyroid disorders, \nand neck or shoulder injuries should avoid this asana. Practice only after \nconsulting the trained yoga \npractitioner. \n \n \nSIRSHASANA \n\f \nSirshasana (headstand pose) \nStage I: Sit in vajrasana. \nClose the eyes and relax the whole body. \nAfter a few minutes, open the eyes, bend forward and \nplace the forearms on a folded blanket with the fingers \ninterlocked and the elbows in front of the knees. \nThe distance between the elbows should be equal to the \ndistance from each elbow to the interlocked fingers, \nforming an equilateral triangle. \nPlace the crown of the head on the blanket between the \ninterlocked fingers. Wrap the hands around the head to \nmake a firm support so that it cannot roll backward when \npressure is applied. \nStage 2: Lift the knees and buttocks off the floor and straighten \nthe legs. \nStage 3: Slowly walk the feet as close as possible towards the \ntrunk and head, gradually moving the back towards the \nvertical position. \nBend the knees slightly, press the thighs against the \nabdomen and lower chest. \nTransfer the body weight slowly from the toes onto the \nhead and arms, maintaining a steady balance. \n\fRaise one foot off the floor about 20 cm, carefully balance, \nthen raise the other foot and balance on the head and \narms. \nStage 4: Bending the knees, gradually raise the calves in a \ncontrolled movement. Adjust the trunk slightly to counterbalance \nthe weight of the legs. \nFold the legs back so the heels move towards the buttocks. \nTo accomplish this movement contract the muscles of the \nlower back. The knees are now pointing down with the \nlegs together. \nMaintain the position for a few seconds, being aware of \ncomplete balance before proceeding. \nStage 5: Raise the knees to the vertical position. Keeping the \nheels near the buttocks, slowly straighten the hips so that \nthe thighs move up and away from the torso. \nRaise the knees until they point directly upward and the \nthighs are in line with the trunk. \nBalance the body. \nStage 6: Slowly straighten the knees and raise the calves. \nThe whole body should be in one straight line with the \nfeet relaxed. \nThis is the final position. \nClose the eyes and balance the whole body, relaxing in the \nfinal position for as long as is comfortable. \nStage 7: Return to the starting position. \nSlowly bend the knees and lower the body with control in \nthe reverse order until the toes touch the floor. Remain \nwith the head on the ground in the kneeling position for \na short time, then slowly return to the upright position. \n \nBreathing: Inhale at the end of stage 1. \nRetain the breath inside while raising the body into the \nfinal position. Beginners may practise normal breathing \nwhile coming into the posture. \nBreathe normally in the final position. The breath should \nbecome increasingly subtle in this posture as one becomes \naccustomed to it. \nDuration: Beginners should start by holding the pose for 30 \nseconds, gradually adding about 1 minute per week until \nthe desired period is reached. 3 to 5 minutes spent in the \nfinal position is sufficient for general health, however, \nsirshasana may be practised by experts for periods of up \nto 30 minutes. \nAwareness: Physical - for beginners, on maintaining balance. \nFor adepts, on the brain, centre of the head or respiration. \nSpiritual - on sahasrara chakra. \nSequence: While beginners should practise sirshasana at the \nend of their asana programme, more experienced practitioners \nmay perform it either at the beginning or the end. \nIt should be followed by tadasana, as a counterpose, and \nthen shavasana. \n\fContra-indications: Sirshasana should not be practised by \npeople with high blood pressure, heart disease, thrombosis, \narteriosclerosis, chronic catarrh, chronic constipation, \nkidney problems, impure blood, severe near-sightedness, \nweak eye blood vessels, conjunctivitis, chronic glaucoma, \ninflammation of the ears or any form of blood haemorrhage \nin the head; neither should it be practised during pregnancy \nor menstruation. Although it is recommended as a \npreventative measure for headache or migraine, it should \nnot be practised during either. \nBenefits: This asana is very powerful for awakening sahasrara \nchakra and, therefore, it is considered the greatest of all \nasanas. \nSirshasana increases the blood flow to the brain and \npituitary gland, revitalising the entire body and mind. It \nrelieves anxiety and other psychological disturbances which \nform the root cause of many disorders. It is, therefore, \nrecommended for the prevention of asthma, hay fever, \ndiabetes and menopausal imbalance. It also helps to rectify \nmany forms of nervous and glandular disorder, especially \nthose related to the reproductive system. \nThis asana reverses the effect of gravity on the spine. \nStrain on the back is thus alleviated and the reversed flow \nof blood in the legs and visceral regions aids tissue \nregeneration. The weight of the abdominal organs on the \ndiaphragm encourages deep exhalation so that larger \namounts of carbon dioxide, toxins and bacteria are \nremoved from the lungs. \nPractice note: In the final position, most of the weight of the \nbody is sustained by the top of the head, the arms being \nused to maintain balance only. Beginners, however, may \nuse the arms as support until the neck is strong enough to \nbear the full weight of the body, and a reasonable sense of \nbalance has been developed. \nIf the practitioner should fall during the practice, the \nbody should be as relaxed as possible. If the fall is forward, \ntry to fold the knees into the chest so that the impact on \nthe floor is sustained by the feet. If falling backwards, arch \nthe back, again so that the feet sustain the impact. \n \n \nSurya Namaskara \n\f \n \nSALUTATIONS TO THE SUN \nThe Sanskrit name surya here refers to the sun and namaskara \nmeans 'salutations'. Surya namaskara has been handed down \nfrom the enlightened sages of the Vedic Age. The sun symbolises \nspiritual consciousness and, in ancient times, was \nworshipped on a daily basis. In yoga the sun is represented by \npingala or surya nadi, the pranic channel which carries the \nvital, life-giving force. \nThis dynamic group of asanas is not regarded as being a \ntraditional part of hatha yoga practices as it was added to the \noriginal asana group at a later time. However, it is an effective \nway of loosening up, stretching, massaging and toning all the \njoints, muscles and internal organs of the body. Its versatility \nand application make it one of the most useful methods of \ninducing a healthy, vigorous and active life while, at the same \ntime, preparing for spiritual awakening and the resulting expansion \nof awareness. \nSurya namaskara is a complete sadhana, spiritual practice, \nin itself for it includes asana, pranayama, mantra and \nmeditation techniques. It is an excellent group of asanas with \nwhich to start morning practice. Surya namaskara has a direct \nvitalising effect on the solar energy of the body which flows \nthrough pingala nadi. Regular practice of surya namaskara \nregulates pingala nadi, whether it is under-active or overactive. \nRegulation of pingala nadi leads to a balanced energy \nsystem at both mental and physical levels. \nSurya namaskara is composed of three elements: form, \n\fenergy and rhythm. The twelve asanas are the physical matrix \naround which the form of the practice is woven. These asanas \ngenerate prana, the subtle energy which activates the psychic \nbody. Their performance, in a steady, rhythmic sequence, \nreflects the rhythms of the universe; the twenty-four hours of \nthe day, the twelve zodiac phases of the year and the biorhythms \nof the body. The application of this form and rhythm to the \nbody/mind complex generates the transforming force which \nproduces a fuller and more dynamic life. \nTime of practice: The ideal time to practise surya namaskara \nis at sunrise, the most peaceful time of day. Whenever possible, \npractise in the open air, facing the rising sun. Sunset is also a \ngood time to practise as it stimulates the digestive fire. Surya \nnamaskara, however, may be practised at any time provided \nthe stomach is empty. \nPreparation: Before commencing the practice, stand with \nthe feet together or slightly apart, and the arms hanging \nloosely by the side of the body. Close the eyes gently and \nbecome aware of the whole physical body as one homogeneous \nunit. In this position the body may sway from side to side \nor backward and forward. Try to minimise this oscillation and \nbalance the body weight equally on both feet. \nBring the awareness inside the body and mentally begin to \nrelax it. Starting from the top of the head, take the awareness \nsystematically through all the parts, releasing any tension. \nIntensify, once more, the awareness of the whole physical \nbody and feel in harmony with it. \nTake the awareness to the soles of the feet in contact with \nthe floor. Feel that the whole body is being pulled downwards \nby gravity and that any tensions are being pulled down, \nthrough the body and into the ground. At the same time, \nexperience the vital force surging up from the earth and \nflooding the whole being. \nFinally, take the awareness to the eyebrow centre and visualise \na brilliant, red rising sun infusing the whole body and \nmind with its vitalising and healing rays. Imagine you are \nfacing the early morning sunrise, about to practise surya \nnamaskara with smooth synchronised movements, flowing into \none another like a dance. \nPosition 1: Pranamasana (prayer pose) \nThis is the final position and is the same as position 1. \nBring the palms together in front of the chest. \nBreathing: Exhale while assuming the final position. \nAwareness: Physical - on the region of the heart. \nSpiritual - on anahata chakra. \nMantra: Om Mitraye Namaha. \nHASTA UTTHANASANA \nPosition 2: Hasta Utthanasana (raised arms pose) \nRaise and stretch both arms above the head. \nKeep the arms separated, shoulder width apart. \nBend the head, arms and upper trunk backward. \n\fBreathing: Inhale while raising the arms. \nAwareness: Physical - on the stretch of the abdomen and \nexpansion of the lungs. \nSpiritual - on vishuddhi chakra. \nMantra: Om Ravaye Namaha, salutations to the shining one. \nBenefits: This pose stretches all the abdominal organs and \nimproves digestion. It exercises the arm and shoulder \nmuscles, tones the spinal nerves, opens the lungs and \nremoves excess weight. \n \nPADAHASTASANA \nPosition 3: Padahastasana (hand to foot pose) \nBend forward until the fingers or palms of the hands \ntouch the floor on either side of the feet. \nTry to touch the knees with the forehead. \nDo not strain. \nKeep the knees straight. \nBreathing: Exhale while bending forward. \nTry to contract the abdomen in the final position to expel \nthe maximum amount of air from the lungs. \nAwareness: Physical - on the pelvic region. \nSpiritual - on swadhisthana chakra. \nMantra: Om Suryaya Namaha, salutations to he who induces \nactivity. \nContra-indications: People with back conditions should not \nbend forward fully. Bend from the hips, keeping the spine \nstraight, until the back forms a ninety degree angle with \nthe legs, or bend only as far as comfortable. \nBenefits: This pose is useful in eliminating or preventing \nstomach or abdominal ailments. It reduces excess weight \nin the abdominal region, improves digestion and helps to \nremove constipation. It improves blood circulation, makes \nthe spine supple and tones the spinal nerves. \n \nASHWA SANCHALANASANA \nPosition 4: Ashwa Sanchalanasana (equestrian pose) \nPlace the palms of the hands flat on the floor beside the \nfeet. \nStretch the right leg back as far as possible. \nAt the same time, bend the left knee, keeping the left foot \non the floor in the same position. Keep the arms straight. \nIn the final position, the weight of the body should be \nsupported on both hands, the left foot, right knee and \ntoes of the right foot. The head should be tilted backward, \nthe back arched and the inner gaze directed upward to \nthe eyebrow centre. \nBreathing: Inhale while stretching the right leg back. \nAwareness: Physical - on the stretch from the thigh to the \nchest or on the eyebrow centre. \nSpiritual - on ajna chakra. \nMantra: Om Bhanave Namaha, salutations to he who illumines. \n\fBenefits: This pose massages the abdominal organs and improves \ntheir functioning, strengthens the leg muscles and \ninduces balance in the nervous system. \nPractice note: In the final pose the palms of the hands should \nbe flat on the floor initially. Later on, more advanced \npractitioners may come up onto the fingertips. \nPARVATASANA \nPosition 5: Parvatasana (mountain pose) \nTake the left foot back beside the right foot. \nSimultaneously, raise the buttocks and lower the head \nbetween the arms, so that the back and legs form two sides \nof a triangle. \nThe legs and arms should be straight in the final position. \nTry to keep the heels on the floor in the final pose and \nbring the head towards the knees. \nDo not strain. \nBreathing: Exhale while taking the left leg back. \nAwareness: Physical - on relaxing the hips or on the throat \nregion. \nSpiritual - on vishuddhi chakra. \nMantra: Om Khagaya Namaha, salutations to he who moves \nquickly in the sky. \nBenefits: This pose strengthens the nerves and muscles in the \narms and legs. The spinal nerves are toned and circulation \nis stimulated especially in the upper spine, between the \nshoulder blades. \nASHTANGA NAMASKARA \nPosition 6: Ashtanga Namaskara (salute with eight parts or \npoints) \nLower the knees, chest and chin to the floor. \nIn the final position only the toes, knees, chest, hands and \nchin touch the floor. The knees, chest and chin should \ntouch the floor simultaneously. If this is not possible, first \nlower the knees, then the chest, and finally the chin. \nThe buttocks, hips and abdomen should be raised. \nBreathing: The breath is held outside in this pose. There is no \nrespiration. \nAwareness: Physical - on the abdominal region. \nSpiritual - on manipura chakra. \nMantra: Om Pushne Namaha, salutations to the giver of strength. \nBenefits: This pose strengthens the leg and arm muscles, \ndevelops the chest and exercises the region of the spine \nbetween the shoulder blades. \nBHUJANGASANA \nPosition 7: Bhujangasana (cobra pose) \nLower the buttocks and hips to the floor, \nStraightening the elbows, arch the back and push the \nchest forward into the cobra pose. \nBend the head back and direct the gaze upward to the \neyebrow centre. \nThe thighs and hips remain on the floor and the arms \n\fsupport the trunk. \nUnless the spine is very flexible the arms will remain \nslightly bent. \nBreathing: Inhale while raising the torso and arching the back. \nAwareness: Physical - on relaxation of the spine. \nSpiritual - on swadhisthana chakra. \nMantra: Om Hiranya Garbhaya Namaha, salutations to the golden, \ncosmic self. \nBenefits: This pose keeps the spine supple, improving circulation \nin the back region and toning the spinal nerves. It \ntones the reproductive organs, stimulates digestion and \nrelieves constipation. It also tones the liver and massages \nthe kidneys and adrenal glands. \nPosition 8: Parvatasana (mountain pose) \nThis stage is a repeat of position 5. \nFrom bhujangasana assume parvatasana. \nThe hands and feet do not move from position 7. \nRaise the buttocks and lower the heels to the floor. \nBreathing: Exhale while raising the buttocks. \nAwareness: Physical - on relaxing the hips or on the throat \nregion. \nSpiritual - on vishuddhi chakra. \nMantra: Om Marichaye Namaha, salutations to the Lord of the \nDawn. \nPosition 9: Ashwa Sanchalanasana (equestrian pose) \nThis stage is the same as position 4. \nKeep the palms flat on the floor. \nBend the left leg and bring the left foot forward between \nthe hands. \nSimultaneously, lower the right knee so that it touches the \nfloor and push the pelvis forward. \nTilt the head backward, arch the back and gaze at the \neyebrow centre. \nBreathing: Inhale while assuming the pose. \nAwareness: Physical - on the stretch from the thigh to the \nchest, or on the eyebrow centre. \nSpiritual - on ajna chakra. \nMantra: Om Adityaya Namaha, salutations to the son of Aditi, \nthe cosmic Mother. \nPosition 10: Padahastasana (hand to foot pose) \nThis position is a repeat of position 3. \nBring the right foot forward next to the left foot. \nStraighten both knees. \nBring the forehead as close to the knees as possible without \nstraining. \nBreathing: Exhale while performing the movement. \nAwareness: Physical - on the pelvic region. \nSpiritual - on swadhisthana chakra. \nMantra: Om Savitre Namaha, salutations to Lord of Creation. \nPosition 11: Hasta Utthanasana (raised arms pose) \nThis stage is a repeat of position 2. \n\fRaise the torso and stretch the arms above the head. \nKeep the arms separated, shoulder width apart. \nBend the head, arms and upper trunk backward. \nBreathing: Inhale while straightening the body. \nAwareness: Physical - on the stretch of the abdomen and \nexpansion of the lungs. \nSpiritual - on vishuddhi chakra. \nMantra: Om Arkaya Namaha, salutations to he who is fit to be \npraised. \nPosition 12: Pranamasana (prayer pose) \nThis is the final position and is the same as position 1. \nBring the palms together in front of the chest. \nBreathing: Exhale while assuming the final position. \nAwareness: Physical - on the region of the heart. \nSpiritual - on anahata chakra. \nMantra: Om Bhaskaraya Namaha, salutations to he who leads to \nenlightenment. \nPositions 13-24: The twelve positions of surya namaskara are \npractised twice to complete one round. Positions 1 to 12 \nconstitute half a round. In the second half, the positions \nare repeated with two small changes: \na) In position 16, instead of stretching the right foot \nbackward, stretch the left foot back. \nb) In position 21, bend the right leg and bring the right \nfoot between the hands. \nConclusion: On the completion of each half round, lower \nthe arms to the side, relax the body and concentrate on \nthe breath until it returns to normal. After completing \nsurya namaskara, practise shavasana for a few minutes. \nThis will allow the heartbeat and respiration to return to \nnormal and all the muscles to relax. \nPractice note: In reference to position 4: when practising surya \nnamaskara for general or therapeutic purposes, begin by \nplacing the right leg back to activate pingala nadi as \ndescribed above; if practising for mental concentradon \nor for a more meditadonal effect, begin with the left leg \nwhich will activate ida nadi. \nBeeja mantras: As an alternative to the twelve names of the \nsun, there is a series of beeja mantras or seed syllables. \nBeeja mantras do not have any literal meaning but set up \npowerful vibrations of energy within the mind and body. \nThe beeja mantras are six in number and are repeated \nconsecutively in the following order, four times during a \ncomplete round of surya namaskara: \n1. Om Hraam 4. Om Hraim \n2. Om Hreem 5. Om Hraum \n3. Om Hroom 6. Om Hrah \nWhen surya namaskara is practised too fast to repeat the \nsun mantras, the beeja mantras may be used. \nDuration: For spiritual benefits, practise 3 to 12 rounds slowly. \nFor physical benefits, practise 3 to 12 rounds more quickly. \n\fBeginners should start with 2 or 3 rounds and add one \nmore round every few weeks to avoid fatigue. Advanced \nstudents may practise a larger number of rounds, however, \nstrain should be avoided at all times. In special cases, a \ndaily practice of 108 rounds may be undertaken for \npurification, but only under expert guidance. \nSequence: Surya namaskara is ideally practised before other \nasanas. \nContra-indications: The practice of surya namaskara should \nbe immediately discontinued if a fever, acute inflammation, \nboils or rashes occur. These may develop due to excess \ntoxins in the body. When the toxins have been eliminated, \nthe practice may be resumed. \nSurya namaskara should not be practised by people \nsuffering from high blood pressure, coronary artery \ndiseases, or by those who have had a stroke, as it may over \nstimulate or damage a weak heart or blood vessel system. \nIt should also be avoided in cases of hernia or intestinal \ntuberculosis. \nPeople with back conditions should consult a medical \nexpert before commencing this practice. Although some \nback conditions may be alleviated by this practice, \nconditions such as slipped disc and sciatica will be better \nmanaged through an alternative asana programme. \nDuring the onset of menstruation, this practice should be \navoided. If there are no adverse effects, the practice may \nbe resumed after the initial flow or towards the end of the \nperiod. During pregnancy it may be practised with care \nuntil the beginning of the twelfth week. Following childbirth, \nit may be commenced approximately forty days \nafter delivery for re-toning the uterine muscles. \nGeneral benefits: The practice of surya namaskara as a whole \ngives a great number of benefits. \nIt stimulates and balances all the systems of the body, \nincluding the endocrine, circulatory, respiratory and \ndigestive systems. Its influence on the pineal gland and \nthe hypothalamus helps to prevent pineal degeneration \nand calcification. This balances the transition period \nbetween childhood and adolescence in growing children. \nSynchronising the breath with the physical movements of \nsurya namaskara ensures that the practitioner, at least for \na few minutes daily, breathes as deeply and rhythmically \nas possible. This removes carbon dioxide from the lungs \nand replaces it with fresh oxygen, increasing mental clarity \nby bringing fresh, oxygenated blood to the brain. \nTo conclude, surya namaskara is the ideal practice to \nincrease awareness and bestow good health and wellbeing. \nNote: For more information on this practice see the Bihar School of \nYoga publication Surya Namaskara: A Technique of Solar \nRevitalization. \n \n",
        "summary": "The document provides detailed instructions for various yoga asanas, outlining their steps, benefits, and contraindications. It covers poses like Vrikshasana (Tree Pose), Garudasana (Eagle Pose), Utthita Trikonasana (Extended Triangle Pose), Padahastasana (Hands to the Feet Pose), and Paschimottanasana (Back Stretching Pose). A dedicated section on Meditation Asanas explains their purpose of facilitating prolonged, comfortable sitting for meditation, describing Sukhasana (Easy Pose), Ardha Padmasana (Half-Lotus Pose), Padmasana (Lotus Pose), Siddhasana (Accomplished Pose for Men), Siddha Yoni Asana (Accomplished Pose for Women), and Swastikasana (Auspicious Pose). Further asanas discussed include Ardha Matsyendrasana (Half Spinal Twist), Bhujangasana (Cobra Pose), Dhanurasana (Bow Pose), Halasana (Plough Pose), Sarvangasana (Shoulder Stand), and Sirshasana (Headstand Pose). The document concludes with an extensive guide to Surya Namaskara (Salutations to the Sun), presenting it as a complete spiritual practice that integrates form, energy, and rhythm through a twelve-position sequence, complete with breathing techniques, awareness points, mantras, and a broad range of physical and mental benefits, alongside crucial contraindications. Across all practices, the emphasis is on maintaining proper form, cultivating inner awareness, and respecting the body's limitations for comprehensive well-being.\n\nYoga Poses and Their Key Information\n\n*   <b>Vrikshasana (Tree Pose)</b> Replicates a tree's steady stance, requiring open eyes for balance. It stretches legs, back, and arms, brings body-mind balance, relieves sciatica, and improves focus. Avoid if suffering from migraine, insomnia, high or low blood pressure, or vertigo.\n*   <b>Garudasana (Eagle Pose)</b> Involves squatting and wrapping legs and arms. It improves concentration, strengthens muscles, and loosens shoulder, arm, and leg joints. Avoid with knee, ankle, or shoulder injuries.\n*   <b>Utthita Trikonasana (Extended Triangle Pose)</b> A foundational pose that strengthens legs, stretches the groin, hamstrings, and hips, opens the chest and shoulders, and improves balance and stability. Avoid with back, neck, hip, or shoulder injuries, or headache or migraine.\n*   <b>Padahastasana (Hands to the Feet Pose)</b> Stand and bend forward to touch feet with palms, keeping knees straight. This pose helps eliminate or prevent abdominal ailments, reduces weight in the region, improves digestion, relieves constipation, tones spinal nerves, and makes the spine supple.\n*   <b>Paschimottanasana (Back Stretching Pose)</b> A seated pose involving bending forward from the hips to grasp the feet. It stretches hamstrings, increases hip flexibility, tones and massages abdominal and pelvic organs, stimulates spinal nerves, and is used for various digestive and reproductive disorders. Avoid if you have slipped disc or sciatica.\n*   <b>Meditation Asanas</b> These poses are designed for prolonged, comfortable sitting with a straight spine to prevent sleep and facilitate deep meditation. They include <b>Sukhasana</b> (Easy Pose), <b>Ardha Padmasana</b> (Half-Lotus Pose), <b>Padmasana</b> (Lotus Pose), <b>Siddhasana</b> (Accomplished Pose for Men), <b>Siddha Yoni Asana</b> (Accomplished Pose for Women), and <b>Swastikasana</b> (Auspicious Pose). They promote balance, calm the mind, and redirect energy flows. Precautions include avoiding knee strain and sciatica conditions.\n*   <b>Ardha Matsyendrasana (Half Spinal Twist)</b> A seated twist that tones spinal nerves, makes back muscles supple, relieves lumbago and muscular spasms, massages abdominal organs, and regulates endocrine secretions. Avoid if more than two or three months pregnant, or with peptic ulcer, hernia, or hyperthyroidism without expert guidance.\n*   <b>Bhujangasana (Cobra Pose)</b> An arched back pose that deepens breath, removes backache, keeps the spine flexible and healthy, and tones internal organs like the liver, kidneys, ovaries, and uterus. Avoid with peptic ulcers, hernia, or during pregnancy.\n*   <b>Dhanurasana (Bow Pose)</b> Lying on the stomach, grasping ankles to lift the chest and legs. It tones the heart and lungs, is beneficial for respiratory disorders, and improves posture, also useful for lower back pain. Avoid with heart problems, high blood pressure, hernia, peptic or duodenal ulcers, or appendicitis.\n*   <b>Halasana (Plough Pose)</b> Lying on the back, lifting legs over the head to touch toes to the floor. It massages internal organs, activates digestion, strengthens abdominal muscles, tones spinal nerves, and regulates the thyroid gland. Avoid with hernia, slipped disc, sciatica, high blood pressure, or any serious back problem, especially arthritis of the neck.\n*   <b>Sarvangasana (Shoulder Stand)</b> An inverted pose that stimulates thyroid and parathyroid glands, preserves youth by maintaining spinal elasticity, and cures various ailments like constipation, indigestion, diabetes, varicose veins, and menstrual disorders. Avoid with abnormal blood pressure, glaucoma, detached retina, chronic thyroid disorders, or neck or shoulder injuries.\n*   <b>Sirshasana (Headstand Pose)</b> Considered the greatest asana, it increases blood flow to the brain and pituitary gland, revitalizes the body and mind, relieves anxiety, and helps rectify nervous and glandular disorders. Avoid with high blood pressure, heart disease, chronic glaucoma, or during pregnancy or menstruation.\n*   <b>Surya Namaskara (Salutations to the Sun)</b> A dynamic sequence of twelve asanas performed rhythmically, ideally at sunrise. It is a complete spiritual practice that loosens, stretches, massages, and tones all body systems, regulates vital energy, and increases mental clarity. Avoid if suffering from high blood pressure, coronary artery diseases, hernia, or during menstruation or advanced pregnancy without care.",
        "date": "2025-12-09",
        "category": "Ranger Personnel",
        "vector_id": "DOC_009"
    },
    "DOC_010": {
        "filename": "yellow_ranger_dummy_document.pdf",
        "text": "POWER RANGERS HEADQUARTERS\nINTERNAL DOCUMENT — LEVEL 2 ACCESS\nDocument Title: FIELD OPERATIONS BRIEF — YELLOW RANGER\nDocument ID: PRHQ-OPS-0427-YR\nDate: 07/12/2025\nPrepared By: Operations Division\nSUMMARY:\nThis document provides updated operational directives for the Yellow Ranger regarding\npatrol responsibilities, communication protocols, and current field awareness.\n1. PATROL PRIORITIES:\n- Maintain surveillance over Sector 4B (East Ridge District).\n- Report unusual Morphin Grid fluctuations immediately.\n- Avoid direct engagement unless threat level exceeds Delta-Class.\n2. EQUIPMENT STATUS:\n- Yellow Ranger's Morpher: Fully operational.\n- Sidearm: Energy output within acceptable range.\n- Auxiliary Gear: Updated nano-armor plates installed.\n3. ACTIVE THREAT INTELLIGENCE:\n- Minor Puttie activity detected near the outskirts.\n- No confirmed sightings of high-level enemy commanders.\n- Recommend heightened awareness during solo patrols.\n4. TEAM COORDINATION:\n- Maintain open communication with Red and Blue Rangers during peak patrol hours.\n- Participate in scheduled training simulation at 1800 hours.\n\f5. NOTES:\nThis is a routine operations document. No immediate high-risk alerts issued.\nEND OF DOCUMENT\n",
        "summary": "This internal Power Rangers document provides updated operational directives for the Yellow Ranger, detailing patrol responsibilities, communication protocols, and current field awareness. The Yellow Ranger is instructed to maintain surveillance over Sector 4B (East Ridge District), report unusual Morphin Grid fluctuations immediately, and avoid direct engagement unless the threat level exceeds Delta-Class. Equipment status is good, with the Morpher fully operational and updated nano-armor plates installed. Active threat intelligence indicates minor Puttie activity and no confirmed high-level enemy commanders, recommending heightened awareness during solo patrols. Team coordination requires maintaining open communication with the Red and Blue Rangers and participating in a scheduled training simulation. This is a routine operations document with no immediate high-risk alerts issued.\n\nOperational Directives:\n- The <b>Yellow Ranger</b> has received updated operational directives.\n- Patrols should focus on <b>Sector 4B</b>, reporting Morphin Grid fluctuations immediately.\n- Direct engagement is to be avoided unless the threat level exceeds <b>Delta-Class</b>.\n\nEquipment Status:\n- The <b>Yellow Ranger's Morpher</b> is fully operational.\n- <b>Nano-armor plates</b> have been updated.\n\nThreat Awareness:\n- Minor <b>Puttie activity</b> has been detected.\n- No confirmed sightings of high-level enemy commanders.\n- Heightened awareness is recommended during solo patrols.\n\nTeam Coordination:\n- Maintain open communication with the <b>Red and Blue Rangers</b>.\n- Participate in a scheduled <b>training simulation</b> at 1800 hours.\n\nGeneral Status:\n- This is a <b>routine operations</b> document.\n- No immediate <b>high-risk alerts</b> have been issued.",
        "date": "2025-12-09",
        "category": "Operations",
        "vector_id": "DOC_010"
    }
}