{
    "DOC_001": {
        "filename": "yellow_ranger_dummy_document.pdf",
        "text": "POWER RANGERS HEADQUARTERS\nINTERNAL DOCUMENT — LEVEL 2 ACCESS\nDocument Title: FIELD OPERATIONS BRIEF — YELLOW RANGER\nDocument ID: PRHQ-OPS-0427-YR\nDate: 07/12/2025\nPrepared By: Operations Division\nSUMMARY:\nThis document provides updated operational directives for the Yellow Ranger regarding\npatrol responsibilities, communication protocols, and current field awareness.\n1. PATROL PRIORITIES:\n- Maintain surveillance over Sector 4B (East Ridge District).\n- Report unusual Morphin Grid fluctuations immediately.\n- Avoid direct engagement unless threat level exceeds Delta-Class.\n2. EQUIPMENT STATUS:\n- Yellow Ranger's Morpher: Fully operational.\n- Sidearm: Energy output within acceptable range.\n- Auxiliary Gear: Updated nano-armor plates installed.\n3. ACTIVE THREAT INTELLIGENCE:\n- Minor Puttie activity detected near the outskirts.\n- No confirmed sightings of high-level enemy commanders.\n- Recommend heightened awareness during solo patrols.\n4. TEAM COORDINATION:\n- Maintain open communication with Red and Blue Rangers during peak patrol hours.\n- Participate in scheduled training simulation at 1800 hours.\n\f5. NOTES:\nThis is a routine operations document. No immediate high-risk alerts issued.\nEND OF DOCUMENT\n",
        "summary": "This internal document outlines updated operational directives for the Yellow Ranger concerning patrol responsibilities, communication protocols, and current field awareness. The Yellow Ranger is directed to maintain surveillance over Sector 4B, report any unusual Morphin Grid fluctuations, and avoid direct engagement unless the threat level exceeds Delta-Class. All equipment, including the Morpher and sidearm, is fully operational, and updated nano-armor plates have been installed. Minor Puttie activity has been detected, but no high-level enemy commanders have been sighted, prompting a recommendation for heightened awareness during solo patrols. Team coordination requires open communication with the Red and Blue Rangers during peak patrol hours and participation in a scheduled training simulation. This is a routine operations document, and no immediate high-risk alerts have been issued.\n\nKey Directives:\n- Maintain surveillance over <b>Sector 4B</b> (East Ridge District).\n- Report unusual <b>Morphin Grid fluctuations</b> immediately.\n- Avoid direct engagement unless threat level exceeds <b>Delta-Class</b>.\n\nEquipment Update:\n- Updated <b>nano-armor plates</b> installed on auxiliary gear.\n\nThreat Status:\n- Minor <b>Puttie activity</b> detected near outskirts.\n- No confirmed sightings of high-level enemy commanders.\n- Recommend <b>heightened awareness</b> during solo patrols.\n\nTeam Coordination:\n- Maintain open communication with <b>Red and Blue Rangers</b> during peak patrol hours.\n- Participate in scheduled training simulation at <b>1800 hours</b>.",
        "date": "2025-12-09",
        "category": "Operations",
        "vector_id": "DOC_001"
    }
}